{"Name" : "Arrax",
"Hatched" : "In 115 – 120 AC.",
"Died" : "In 129 AC, Shipbreaker Bay.",
"Rider(s)" : "Lucerys Velaryon.",
"Colors" : "Pearlescent white, Gold (chest and eyes), Yellow (flame).",
"Description" : "Arrax's color is not stated in the published texts. However, the artist commissioned for the 2021 A Song of Ice and Fire Calendar, Sam Hogg, asked for clarification from George R. R. Martin's team, and was told that Arrax's coloration was pearlescent white with yellow flame, golden eyes and a golden chest. At the outbreak of the Dance of the Dragons, Arrax was mature enough to be ridden, but still young and growing. He was five times smaller than Vhagar.",
"History" : "Princess Rhaenyra Targaryen's three eldest sons by her husband, Ser Laenor Velaryon, were Jacaerys (b. 114 AC), Lucerys (b. 115 AC), and Joffrey (b. 117 AC). The greens, the rival faction at court who supported Rhaenyra's stepmother Alicent Hightower and her children, spread the accusation that Rhaenyra's three sons were not really Laenor's, but bastards fathered by Ser Harwin Strong. In an effort to confirm that he considered Rhaenyra and her sons the true heirs to the throne, her father King Viserys I Targaryen decreed that a dragon egg would be put in the cradle of each of the boys, to bond with the dragons that hatched from them. Those who doubted the paternity of Rhaenyra's sons also doubted that the eggs would ever hatch, but they were quickly disappointed, as each of the eggs soon hatched in turn. The hatchlings were named Vermax (bonded with Jacaerys), Arrax (bonded with Lucerys), and Tyraxes (bonded with Joffrey). The exact date each hatched is not known, but the last seems to have hatched by no later than about 120 AC. At the start of the civil war between Queen Rhaenyra and her half brother, King Aegon II Targaryen, Lucerys was thirteen years old, and his dragon Arrax was thriving and growing every year. At Rhaenyra's first black council on Dragonstone, Lucerys and his brother Jacaerys volunteered to serve as her envoys to the lords of Westeros to raise support for her claim, and to show their legitimacy as Targaryens by riding on dragons. Rhaenyra allowed this, but she first made her young sons swear on The Seven-Pointed Star that they would not take part in any fighting. Prince Jacaerys flew north as a messenger on Vermax. Prince Lucerys, as the younger son, was sent on a mission that was considered shorter and safer than his brother Jacaerys's, flying on Arrax as a messenger to Storm's End, where it was expected that Lord Borros Baratheon would give him a warm welcome. Lucerys and Arrax arrived at Storm's End before a gathering storm, and discovered that Prince Aemond Targaryen, an emissary for his brother, King Aegon II, had already arrived on Vhagar, to acquire Borros's allegiance. Lucerys could not match Aemond's offer, and Borros rejected Rhaenyra's attempt at alliance. However, before Lucerys could leave, he was challenged by Aemond, who insisted that Lucerys put out his own eye to repay him for the eye Aemond had lost in a fight with Lucerys years before. However, Lucerys refused, telling him he came as an envoy, not a knight, but Aemond demanded Luke's eye or his life. At this, Lord Borros intervened, not wanting the blood of envoys to be shed under his roof, and his guards escorted Lucerys back to the castle yard where Arrax waited amidst a terrible storm. When Borros's daughter Maris taunted Aemond, asking him if Lucerys had removed his balls as well as his eye, Aemond became enraged. When he asked Borros's leave to go, Borros told Aemond that he had no say about what he did while not underneath Borros's roof, and allowed him to depart. As Aemond mounted Vhagar and went after Luke, Arrax was struggling to stay aloft in the storm. Arrax was younger and swifter, and on a calm day might have been able to outfly his pursuer, but the weather impeded him, and Vhagar was five times the size of her foe and the hardened survivor of a hundred battles. The two dragons met above Shipbreaker Bay. According to Archmaester Gyldayn, if there was a fight, it could not have lasted long. Watchers on the walls of Storm's End saw distant blasts of flame, and heard a shriek louder than the thunder. Then the two dragons were locked together, as lightning crackled around them. The fight ended when Arrax fell, broken, to be swallowed by the storm-lashed waters of the bay. Arrax's head and neck washed up beneath the cliffs below Storm's End three days later. Prince Lucerys's body was never found. Gyldayn notes that some claim that Vhagar snatched Lucerys off Arrax's back and swallowed him whole. Some have even claimed that Luke survived his fall and swam to safety, but lost all memory of who he was, spending the rest of his days as a simpleminded fisherman. But more legitimate historians such as Munkun disregard such tales, and state that Lucerys died with his dragon."
}