{
"Name" : "Balerion",

"Hatched" : "In or before 114 BC, Valyria.",

"Died" : "In 94 AC.",

"Rider(s)" : "Aegon I Targaryen, Maegor I Targaryen, Aerea Targaryen, Viserys I Targaryen.",

"Colors" : "Black (scales and wings), Black with swirls of red (flame).",

"Description" : "Balerion, called the Black Dread, was a dragon of House Targaryen. He was ridden by King Aegon I Targaryen during the Conquest, alongside his sister Queen Visenya's Vhagar, and his sister Queen Rhaenys's Meraxes. Other known riders of Balerion were King Maegor I Targaryen, Princess Aerea Targaryen and Prince Viserys Targaryen. Balerion died of old age in 94 AC during the reign of King Jaehaerys I Targaryen, more than two hundred years old. Balerion was the largest of all the Targaryen dragons since Aegon's Conquest. His wingspan was so large that his shadow could engulf entire towns when he passed overhead. His teeth were as long as swords, and his jaws were large enough to swallow an aurochs whole, or even one of the hairy mammoths that are said to roam the cold wastes beyond the Port of Ibben. By 93 AC, Balerion had finally stopped growing. He had grown sluggish and heavy and was difficult to rouse. When Prince Viserys Targaryen claimed the dragon that year, the dragon struggled to take to the air. Prince Viserys believed the dragon no longer had the strength to fly from King's Landing to Dragonstone. Balerion was willful, and not a beast to trifle with.",

"History" : "Balerion was named after an ancient god of the Valyrian Freehold. He was born in Valyria, and was one of the five dragons Aenar Targaryen brought with him when he fled to Dragonstone to survive the Doom of Valyria. After the other four of Aenar's dragons died, Balerion became the last creature to have seen the Freehold in its prime, Balerion was eventually claimed by Lord Aegon Targaryen, some time before he married his sisters Visenya and Rhaenys. Aegon became involved in the wars in the Disputed Lands when Pentos and Tyrosh approached him, inviting him to join a grand alliance against Volantis, and he chose to heed their call. Mounting Balerion, he flew east to meet the Prince of Pentos and the magisters of the Free City, then flew to Lys in time to set ablaze a Volantene fleet trying to take the city. Afterwards, Aegon turned his attention to conquering the Seven Kingdoms, during which he flew on Balerion. Aegon descended on Lords Mooton and Darklyn, killing both of them during Aegon's first test. After the ironborn victory at the Wailing Willows, Balerion burned the victors on the Gods Eye. Next, Aegon took Balerion to Harrenhal, where Harren Hoare, King of the Isles and the Rivers, had taken refuge in his formidable fortress. When Harren the Black had not yielded by sunset, Aegon took Balerion high up and descended inside the castle walls, putting the new castle to flame. Balerion's dragonfire burned so hot that the towers of Harrenhal went up like candles, melting and twisting into the shapes they retain to this day. King Harren and his remaining sons all perished, ending the line of House Hoare. The men of Crackclaw Point quickly surrendered to Visenya after learning of the burning of Harrenhal. Aegon next rode Balerion in the Field of Fire, besides his sisters on Vhagar and Meraxes. Between the three dragons, four thousand men were burned to death, including Mern IX Gardener, King of the Reach, resulting in Targaryen victory. When Aegon learned that Torrhen Stark, King in the North, had crossed the Neck and was leading an army into the riverlands, he raced ahead of his army on Balerion to meet the threat. When the Targaryen host was encamped at one side of the Trident and the northern host on the other side, Torrhen's bastard brother, Brandon Snow, offered to assassinate the sleeping dragons. Recalling the destruction the three dragons had caused at the Field of Fire, Torrhen instead submitted to Aegon. After Aegon was crowned by the High Septon, he was cheered by tens of thousands of onlookers as he flew on Balerion through the streets of Oldtown. According to song, at the end of the war Balerion helped to forge the Iron Throne by melting the swords of Aegon's fallen enemies. In 2 AC, Aegon flew his dragon to the Iron Islands to end the succession struggle among the ironborn. Aegon flew Balerion during the First Dornish War, finding Sunspear abandoned when he arrived. Dorne rose in rebellion after he departed, however, and Lord Orys Baratheon was mutilated by the Wyl of Wyl. Aegon retaliated by burning several of House Wyl's keeps, and the king later attacked Sandstone, Vaith, and the Hellholt with the aid of Visenya. Aegon burned Skyreach after House Fowler attacked Nightsong. During the two years of the Dragon's Wroth following the death of Rhaenys Targaryen, each Dornish castle (with the exception of Sunspear) was burned multiple times by the vengeful Aegon and Visenya. King Aegon made frequent royal progresses throughout the Seven Kingdoms. Besides allowing the new monarch to learn more about his subjects, the sight of Balerion during these visits also helped to prevent rebellion. King Maegor I Targaryen and Balerion burn the Sept of Remembrance, by Jordi Gonzalez for The World of Ice & Fire.After the death of King Aegon I Targaryen, Balerion was claimed by his younger son, Prince Maegor, who had long coveted his father's mount, and had not claimed another dragon because he considered all others unworthy. After Jonos Arryn imprisoned his brother Ronnel, Lord of the Eyrie, and declared himself independent of the Iron Throne, Maegor rode the Black Dread to the Vale of Arryn and put down his rebellion, When Maegor was exiled to Pentos as punishment for his polygamous marriage, he took Balerion with him. After the death of his elder brother, King Aenys I, Maegor flew back to Westeros on Balerion to claim the Iron Throne, During the Faith Militant uprising, King Maegor used Balerion in the burning of the Sept of Remembrance and in the battle at the Great Fork of the Blackwater Rush. In the westerlands, the king burned the seats of Houses Broome, Doggett, Falwell, and Lorch. Maegor threatened to attack Oldtown as well, but the city opened its gates to the king after the unexpected death of the High Septon. In the Battle Beneath the Gods Eye, Maegor used Balerion to kill his nephew Prince Aegon and his dragon Quicksilver. After the completion of the Red Keep, Maegor began construction of the Dragonpit to house Balerion, Vhagar, and other dragons, After Maegor's death, Balerion returned to Dragonstone, In late 54 AC, Princess Aerea Targaryen claimed Balerion from the yard of Dragonstone one morning. They disappeared and went missing for more than a year. King Jaehaerys I Targaryen sent expeditions to try and locate Balerion and the young princess, and the master of coin, Rego Draz, offered a reward for any information on their whereabouts, but none came forward that were credible. Balerion was the largest living dragon in the world, but there were no sightings of the dragon anywhere. Septon Barth believed that the lack of sightings suggested that Balerion was no longer in Westeros. Rhaena Targaryen departed on Dreamfyre to search for Balerion and her missing daughter, Balerion returned to King's Landing in 56 AC, descending into the courtyard of the Red Keep with Aerea barely clinging to him. The princess was severely ill, and died soon after. Barth's accounts describe wounds and half-healed scars on Balerion. The dragon bore a huge jagged rent down his left side, almost nine feet long, and fresh blood still dripped from the wound, hot and smoking. Barth speculated that, when Aerea claimed Balerion, she was unable to bend the dragon to her will, and instead the dragon had taken her to the place he had been born, Valyria. Shortly thereafter, Balerion became the first dragon to be housed in the Dragonpit, where he was guarded by the Dragonkeepers, Prince Baelon Targaryen smacked Balerion on his snout the first time the boy entered the Dragonpit. When Princess Alyssa Targaryen came to the Dragonpit to claim a dragon of her own in 75 AC, the Dragonkeepers persuaded her not to try and claim Balerion, insisting that the dragon had become old and slow, suggesting to her that she would much more prefer a faster dragon, The last rider of Balerion was Prince Viserys Targaryen, who entered the Dragonpit to claim the dragon in 93 AC. Balerion was hard to rouse, and struggled when Viserys urged him into the sky. They flew around King's Landing three times, although Viserys later confided to his father that he had originally intended to fly Balerion to Dragonstone. However, fearing the dragon lacked the strength to do so, Viserys had opted otherwise, Balerion died in 94 AC, less than a year after Viserys claimed him as his mount, Princess Rhaenys Targaryen named her black kitten after Balerion, and the girl often pretended that her cat was actually the Black Dread, Along with eighteen other Targaryen dragon skulls, Balerion's skull hung on a wall in the Red Keep's throne room. After Robert's Rebellion, King Robert I Baratheon had the skulls removed from the throne room and stored them in a dank cellar. In 284 AC, when Tyrion Lannister visited the capital for the wedding of his sister Cersei to Robert, he observed the skulls in the cellar, including Balerion's."
}