{"Name" : "Cannibal",

"Hatched" : "In or before 114 BC, Dragonstone.",

"Died" : "Some time after the end of the Dance, the Cannibal vanished.",

"Rider(s)" : "None.",

"Colors" : "Coal black, Green (eyes).",

"Description" : "The Cannibal was a wild dragon that lived on Dragonstone during the Dance of the Dragons, Was black as coal, with menacing green eyes. He was the largest and oldest of the three completely wild dragons dwelling on Dragonstone.",

"History" : "The Cannibal's exact age has not yet been stated. The wild dragon Sheepstealer is said to have hatched when the Old King was still young, which could be in the early years of reign of Jaehaerys I Targaryen or, more generally, during his youth, and Cannibal is said to have been the eldest and largest of the wild dragons having taken part in the Sowing, being therefore even older than Sheepstealer. Some among the small folk of Dragonstone claimed that the Cannibal lived on the island even before the Targaryens arrived in 114 BC, a possibility that would make him, despite his size not being considered bigger than that of Vhagar and Vermithor, the oldest living dragon in Westeros at the time of the Dance of the Dragons, even older than Vhagar. If the Cannibal was from a different lineage of dragons altogether, that might also have explained why it was so antagonistic to the other Targaryen dragons. However, Grand Maester Munkun and Septon Eustace doubt these claims. The Cannibal was known to attack smaller dragons. He laired at the back of the Dragonmont, on its eastern side. Prior to the Dance of the Dragons, would-be dragontamers had made attempts to ride him a dozen times, and his lair was littered with their bones. When Prince Jacaerys Velaryon called for dragonriders in 129 AC, none of the dragonseeds who attempted to tame the wild dragons were foolish enough to disturb the Cannibal due to his reputation - and any who were, did not return to tell the tale. However, when Silver Denys tried to master Sheepstealer, the dragon tore off his arm. As his sons struggled to stanch his wound, the Cannibal descended on them, drove off Sheepstealer, and devoured Silver Denys and his sons. In 130 AC, when the carcass of the Grey Ghost was discovered at the Dragonmont's base, burned and broken, torn apart and partially devoured, Dragonstone's castellan Ser Robert Quince was quick to name the Cannibal as the killer (though in truth it was actually Sunfyre). Some fisherfolk began to worry that the dragon would attack them as well, and urged Ser Robert to send knights to kill the Cannibal. He refused, reasoning that if they left the dragon alone he would not bother them, and forbade fishing in the waters to the east of the Dragonmont, where Grey Ghost's body had been found. However, Lady Baela Targaryen was not satisfied with this explanation, and proposed to discover the truth herself, as she had no fear of the Cannibal and her dragon Moondancer could outfly him. But Ser Robert barred her from taking the risk, and confined Baela to her chambers. The Cannibal was one of the four dragons that survived the Dance of the Dragons. In 132 AC, it was said that during the burial at sea of Lord Corlys Velaryon, the Cannibal took wing and flew to salute the deceased. However, Archmaester Gyldayn notes this may be a later embellishment of the story, since the Cannibal would be more likely to eat the corpse than salute it."}
