{"Name" : "Caraxes",

"Hatched" : "In or before 72 AC, Dragonstone.",

"Died" : "In 130 AC, the Gods Eye.",

"Rider(s)" : "Aemon Targaryen, Daemon Targaryen.",

"Colors" : "Red scales, Yellow eyes.",

"Description" : "Caraxes was red, huge, and lean. In battle he was formidable, fearsome, and experienced. By the end of his life, Caraxes was considered an old and cunning dragon.",

"History" : "It is unknown when Caraxes hatched from his egg but by 72 AC he was a young dragon of rideable size. That year, Aemon Targaryen, Prince of Dragonstone and heir apparent of the Iron Throne, claimed Caraxes for the first time. The Dragonkeepers considered him to be the fiercest of all the young dragons of the Dragonpit and nicknamed him the 'Blood Wyrm'. The Targaryen siblings Alyssa, Baelon and Aemon liked to fly together on their dragons (Meleys, Vhagar, and Caraxes respectively). Aemon used Caraxes against the Dornish fleet during the Fourth Dornish War in 83 AC. When rogue Myrmen invaded parts of the island of Tarth in 92 AC, Aemon flew to the island on Caraxes's back to help lords Cameron Tarth and Boremund Baratheon fight back the invaders. Caraxes easily outdistanced the Velaryon fleet led by Lord Corlys Velaryon in the process. Caraxes was eating goats when Prince Aemon was killed by a crossbow bolt in the throat. By 105 AC, Aemon's nephew, Prince Daemon Targaryen, had claimed Caraxes as his mount. Daemon took his paramour Mysaria with him on Caraxes when he retreated from King's Landing for Dragonstone. Daemon used Caraxes during the War for the Stepstones (106–115 AC). During those years, Daemon divided his time between the Stepstones and Dragonstone where he would often fly with his niece, Princess Rhaenyra, and her dragon Syrax. After Daemon remarried to Lady Laena Velaryon, the newly wed toured the Free Cities of Essos with their dragons Caraxes and Vhagar. Huge crowds came to see both dragons everywhere they went. At the start of the Dance of the Dragons, Daemon landed Caraxes a top Kingspyre Tower during the assault on Harrenhal. Atop Caraxes later in the civil war, Daemon challenged Aemond Targaryen and Vhagar at Harrenhal. All four were killed in the ensuing Battle Above the Gods Eye. At the end of the fight, Vhagar locked with Caraxes and they fell into the Gods Eye. While in freefall, even as Vhagar's claws opened up Caraxes's belly and used her teeth to tear off one of his wing-arms, Caraxes locked his teeth onto the larger dragon's throat and tore it out. Vhagar did not survive the force of the fall. Somehow, Caraxes managed to live long enough to pull himself out of the water and onto the shore, even though his entrails were falling out and one of his arms had been torn clean off. The dragon soon died in front of the walls of Harrenhal."}  
