{"Name" : "Dreamfyre",

"Hatched" : "In or shortly before 32 AC.",

"Died" : "In 130 AC, the Dragonpit.",

"Rider(s)" : "Rhaena Targaryen, Helaena Targaryen.",

"Colors" :  "Pale blue, with silver markings, Silver crests and pale blue wings.",

"Description" : "Dreamfyre was a slender she-dragon, By 35 AC, Dreamfyre was large enough for the twelve-year-old Rhaena Targaryen to mount her.",

"History" : "Dreamfyre was hatched during the reign of King Aegon I Targaryen. As a hatchling, she bonded with nine-year old Princess Rhaena Targaryen, Aegon I's first grandchild, in 32 AC. Three years later, she became Dreamfyre's rider. In 41 AC Rhaena was wed to her brother, Aegon, and sent on a royal progress by their father King Aenys I Targaryen. Rhaena wished to take Dreamfyre with her, but her father forbade it, as Aegon had not yet claimed a dragon, and the king did not want his son to be seen riding a horse, while his wife rode a dragon. Dreamfyre remained in King's Landing. Rhaena's father, King Aenys, died in 42 AC and the crown was usurped by their uncle, Maegor. Rhaena and her husband smuggled themselves into King's Landing in 43 AC, while Maegor was at Oldtown. Rhaena was reunited with Dreamfyre and Aegon finally claimed a dragon of his own, his father's dragon Quicksilver. Knowing they could not hold the Iron Throne, they left King's Landing on their dragons to raise an army. When Aegon went to war against their uncle, Rhaena's and Dreamfyre did not accompany them. Aegon, along with Quicksilver, was killed in the Battle Beneath the Gods Eye by Maegor mounted on Balerion the Black Dread. Since Dreamfyre was younger and smaller than Quicksilver, many historians believe that Dreamfyre would not have been much of a threat to the Black Dread. Princess Rhaena sent her twin daughters Aerea and Rhaella into hiding. However, she felt that she could not hide herself, as she had Dreamfyre with her, who was not easily hidden. Therefore she flew Dreamfyre to Fair Isle off the coast in the Sunset Sea, where they stayed at Faircastle. There they remained until 47 AC, when Maegor commanded Rhaena to return to King's Landing. Not wanting to bring Maegor's wrath and Balerion's fires down on Fair Isle, Rhaena flew on Dreamfyre to the Red Keep, only to find out that Maegor wished to make Rhaena his bride and that his mistress of whisperers, Tyanna of the Tower, had found her daughters and used them as hostages. The next year, Rhaena fled the Red Keep upon Dreamfyre, together with her elder daughter Aerea, and Maegor's Valyrian steel sword Blackfyre, to join her only surviving brother, Jaehaerys. By 43 AC, Dreamfyre had already produced two clutches of dragon eggs. During Rhaena's second residence at Fair Isle in 49–50 AC, Dreamfyre laid another clutch of eggs. Dreamfyre's presence on the island made some of the residents anxious, and the eggs caused a begging brother to start preaching that Fair Isle would soon be overrun by dragons who would eat both sheep and men, and called for a dragonslayer to kill the dragons to prevent it. The man was arrested, but nonetheless his words inspired fear wherever they were spread. Rhaena chose to depart Fair Isle, taking Dreamfyre and the eggs with her. After some time at Casterly Rock, where Dreamfyre had been granted an entire stable, Lord Lyman Lannister expressed his interest in the three eggs and asked how they would hatch, and when that could be expected. Lady Jocasta Lannister suggested to Rhaena that gifting the Lannisters one or more of the three eggs would be a good way to demonstrate her gratitude. After Rhaena refused, Lord Lyman offered to buy the eggs. Rhaena left Casterly Rock and toured the westerlands, but many Western lords desired a dragon of their own, and she grew uncomfortable with how they looked at Dreamfyre or her eggs. In 51 AC Rhaena visited King's Landing upon Dreamfyre to attend the second wedding of her siblings King Jaehaerys and Queen Alysanne, and explained her difficulties. Rhaena was eventually granted Dragonstone as her own seat. Dreamfyre made her lair in the dragon yards at Dragonstone, and the clutch of eggs laid at Fair Isle soon hatched. Rhaena introduced her daughter, Princess Aerea, to Dreamfyre's hatchlings, and urged her to choose one and fly.In 54 AC, Rhaena discovered her former close friend and companion, Elissa Farman, had stolen three dragon eggs from the Dragonstone hatcheries and fled to Pentos, and flew Dreamfyre to King's Landing to inform her brother King Jaehaerys of the theft. Jaehaerys made plans with Rhaena to make war with their dragons Vermithor and Dreamfyre should hatchling dragons appear anywhere in the world, though this turned out to be unnecessary. Later that year, Rhaena flew Dreamfyre to Storm's End to reconcile with her mother, Dowager Queen Alyssa Velaryon, but arrived too late for Alyssa's death in childbirth. Still within that year, Rhaena's female companions were all murdered by her husband, Androw Farman, using the tears of Lys. When his crime was discovered, Androw committed suicide by leaping from the window of the Chamber of the Painted Table; Rhaena had his body hacked to pieces and fed to Dreamfyre and the other dragons of Dragonstone. Near the end of 54 AC, Rhaena discovered that her daughter Aerea had mounted Balerion and fled Dragonstone. Rhaena flew Dreamfyre to the Red Keep, convinced that Aerea had gone there. Rhaena remained at court while Jaehaerys sent forth ravens across the realm, but after seven days, she declared that she was going to look for Aerea herself and left on Dreamfyre in search of her daughter.[3] For more than a year, Rhaena flew Dreamfyre all over Westeros, from Oldtown to Highgarden to Crakehall, Casterly Rock and Fair Isle, to the barrowlands and the banks of the Fever River, and as far south as the Red Mountains of Dorne and the canyons of the Torrentine. Rhaena and Dreamfyre were seen flying over the Fingers and the Mountains of the Moon, the rainwood on Cape Wrath, the Shield Islands, and the Arbor; however, her search was in vain. In 56 AC, while residing at Greenstone, Rhaena received a message that Princess Aerea had returned to King's Landing on Balerion. She had been infected with an insidious disease that killed her that same day. By the time the raven carrying the news had reached Rhaena, Aerea had already been cremated. Rhaena returned to King's Landing and took possession of her daughter's ashes. Refusing Jaehaerys's offer to have Aerea's ashes interred on Dragonstone as Aerea had hated living there, Rhaena instead took the ashes into the sky upon Dreamfyre and released them into the wind, claiming that Aerea had wanted to fly. Rhaena went into self-imposed isolation at Harrenhal after her daughter's death. Although she still frequently rode Dreamfyre, she wished to be left alone. Dreamfyre remained at Harrenhal with Rhaena until her death in 73 AC, after which Dreamfyre made her lair in the Dragonpit at King's Landing. During the reign of King Viserys I Targaryen, Dreamfyre bonded with Princess Helaena Targaryen. Helaena was riding Dreamfyre by age eleven,[8] and the dragon was beloved to her. During the Dance of the Dragons, after Helaena's six-year old son was slain during the civil war, Helaena spent her days in darkness, weeping, and was not capable of riding Dreamfyre anymore. Dreamfyre resided in the Dragonpit, and it is said that when Helaena threw herself to her death from her window in Maegor's Holdfast, Dreamfyre rose suddenly with a roar that shook the Dragonpit and snapped two of the chains that bound her. Dreamfyre cracks the dome of the Dragonpit during the Storming of the Dragonpit, as depicted by Douglas Wheatley in Fire & Blood. Dreamfyre remained chained in the Dragonpit when the people of King's Landing stormed the pit. Out of the four dragons present, Dreamfyre was the only dragon able to break free of her chains when the mob broke in. She took wing, circled the cavernous interior of the dome and swooped down to attack the men below. She slew more men than the other three dragons combined. Archers and crossbowmen loosed arrows and quarrels at the her, and whenever she landed men swarmed her to attack, driving her back into the air. Eventually one of her eyes was nicked by a crossbow bolt. Half-blind and maddened, Dreamfyre flew into the Dragonpit's great dome above, which cracked on impact. Half of it came tumbling down, crushing her and the dragonslayers under tons of broken stone and rubble."}
