{"Name" : "Drogon",

"Hatched" : "In 299 AC, Dothraki sea.",

"Died" : "Alive.",

"Rider(s)" : "Daenerys Targaryen.",

"Colors" : "Black with streaks of red or black (scales), Red (eyes, horns, and spinal plates), Red or black (wings), Black shot with red (flame), Black (blood).",

"Description" : "Drogon is one of the three dragons born in the Dothraki sea to Daenerys Targaryen. He is named after her late husband, Khal Drogo. Drogon is believed by some to be the reincarnation of Balerion the Black Dread, but Daenerys decides to give him a new name for his new life, As of mid-300 AC, Drogon has grown large in the wild; his wings stretch twenty feet from tip-to-tip, black as jet, Drogon is the largest and most aggressive of Daenerys's three dragons, the fiercest and wildest. She has problems reining him in. After a hunt, when Drogon is full of food, he likes to bask in the sun.",

"History" : "At the wedding of Daenerys Targaryen to Khal Drogo, she receives multiple bride gifts, including three petrified dragon eggs from Magister Illyrio Mopatis. Drogon's egg is black as the midnight sea, alive with scarlet ripples and swirls. The maegi Mirri Maz Duur proclaims that only death can pay for life. After Khal Drogo's death, Daenerys burns his body, with Mirri Maz Duur and the three eggs on his pyre. When Daenerys hears the crack of the dragon eggs hatching, she walks into the inferno. In the flames, Drogon hatches, along with his brothers, Viserion and Rhaegal, the first dragons born in a century and a half, In the Red Waste, Daenerys names the black dragon Drogon, after her husband Khal Drogo. She learns that the dragons, no larger than scrawny cats, will only eat cooked meat, As Daenerys travels westward on the Summer Sea, bold Drogon is the first of her dragons to fly above the water, flapping from ship to ship. He is also the first to kill, flaming fish as they leap out of the water, snatching them up, and eating them. The dragons are now about the size of a small dog, Drogon slightly larger than the other two. In order to pay for all Unsullied in Astapor, Daenerys agrees to sell Drogon to the Good Masters. However, once she has received the Unsullied, Drogon refuses to go with Kraznys mo Nakloz. Daenerys tells the masters that a dragon is no slave, and with her command Dracarys, Drogon looses his flame in Kraznys's face. Daenerys then commands the Unsullied to attack their former masters, and Drogon and the other dragons join in with the destruction, As Queen of Meereen, Daenerys frequently receives petitioners asking for repayment for the sheep that her dragons have killed and eaten. Drogon particularly files far from Meereen, and can easily devour a sheep a day. A man appears before Queen Daenerys in her audience chamber, carrying a sack of burned and cracked bones, claiming they are the remains of his child Hazzea, and that the black one, the winged shadow had killed and eaten her, Horrified, Daenerys orders all three dragons to be captured and imprisoned. Viserion and Rhaegal are eventually chained (though not without cost) in a makeshift dragon pit in the Great Pyramid. Though the bravest of Daenerys's men try to capture Drogon three times, Drogon escapes their attempts, burning most of the men and killing four. He disappears, last seen flying north toward the Dothraki sea. When the fighting pits of Meereen are re-opened, Drogon appears above Daznak's Pit, drawn by the noise and smell of blood. Always the largest of Daenerys's three dragons, in the wild he has grown even larger, his wings now measuring twenty feet across. Drogon descends into the pit and kills the boar that had just killed Barsena Blackhair, and begins to devour both corpses. He sets much of the arena ablaze once provoked, and causes chaos and carnage as the citizens flee and trample one another. An animal handler named Harghaz attacks Drogon with a long spear, and comes close to slaying him. When Drogon is impaled by the spear, he and Daenerys scream as one. Drogon kills Harghaz, tearing his arm off. When her husband, Hizdahr zo Loraq, shouts for his men to kill Drogon, Daenerys leaps into the pit, running to her child. Daenerys manages to use a whip to make Drogon obey her, though with much difficulty, losing her hair and clothing when he bathes her in dragonfire. She mounts Drogon to pull the half-melted spear from his back, but after she does, he takes off. Daenerys holds on as Drogon flies away, becoming the first dragonrider in a century and a half. Drogon takes Daenerys to his lair in the Dothraki sea, a hill that she calls Dragonstone. Daenerys learns to command Drogon's flight with her whip and her words, but he refuses to return to Meereen. She attempts to walk there alone, but becomes delirious from the heat, lack of water and food, and from an illness brought on by eating green berries. In the grass, Daenerys sees a Dothraki scout, but he does not notice her, distracted by Drogon flying above. After the scout races away, Daenerys calls Drogon to her, and they fly, following the scout. Drogon kills one horse from a herd, and he and Daenerys devour it together. Afterwards, Drogon and Daenerys are discovered by Khal Jhaqo and his khalasar."
}