{"Name" : "The last dragon",

"Hatched" : "around 129AC - 131 AC.",

"Died" : "In 153 AC",

"Rider(s)" : "None.",

"Colors" : "Green withered wings.",

"Description" : "The last dragon belonging to House Targaryen died young in 153 AC, during the later part of the reign of King Aegon III Targaryen, who was thereafter called the Dragonbane. Her death marked the extinction of dragons in Westeros and beyond, until Daenerys Targaryen managed to hatch three dragons around a century and a half later. lived in King's Landing. She was small and stunted, with withered wings. Her name is not known.",

"History" : "The last dragon was born to House Targaryen during the reign of King Aegon III Targaryen. Although she was sickly, she laid a clutch of five eggs, which never hatched.In 152 AC, Ser Arlan of Pennytree, then a young boy, was taken to King's Landing by his grandfather, where he saw the last dragon, as well as her eggs, which he later described as hard as stone, but beautiful. The last dragon died in 153 AC in King's Landing. Some rumors claimed that Aegon III poisoned her, as he had been afraid of dragons since the day he had seen Sunfyre, the dragon of his uncle, King Aegon II Targaryen, devour his mother, Queen Rhaenyra Targaryen. In the final years of the Targaryen dynasty, nineteen dragon skulls hung on the walls of the throne room. Two of these skulls were from the last hatchlings born on Dragonstone, and were no bigger than a mastiff's skull, and oddly misshapen. Due to the description of the skulls, one of them may be the skull of the last Targaryen dragon. It is thought by some that magic began to leave the world the day the last dragon died. Ser Arlan believed that summers became shorter after the last dragon died, and winters longer and crueler, The last dragon was born to House Targaryen during the reign of King Aegon III Targaryen. Although she was sickly, she laid a clutch of five eggs, which never hatched. In 152 AC, Ser Arlan of Pennytree, then a young boy, was taken to King's Landing by his grandfather, where he saw the last dragon, as well as her eggs, which he later described as hard as stone, but beautiful. The last dragon died in 153 AC in King's Landing. Some rumors claimed that Aegon III poisoned her, as he had been afraid of dragons since the day he had seen Sunfyre, the dragon of his uncle, King Aegon II Targaryen, devour his mother, Queen Rhaenyra Targaryen. In the final years of the Targaryen dynasty, nineteen dragon skulls hung on the walls of the throne room. Two of these skulls were from the last hatchlings born on Dragonstone, and were no bigger than a mastiff's skull, and oddly misshapen. Due to the description of the skulls, one of them may be the skull of the last Targaryen dragon. It is thought by some that magic began to leave the world the day the last dragon died. Ser Arlan believed that summers became shorter after the last dragon died, and winters longer and crueler."
}