{"Name" : "Meleys",

"Hatched" : "In before 75 AC.",

"Died" : "In 129 AC, Rook's Rest.",

"Rider(s)" : "Alyssa Targaryen, Rhaenys Targaryen.",

"Colors" : "Meleys had scarlet scales and pink membranes on her wings, Her crest, horns, and claws were bright as copper.",

"Description" : "Meleys, called the Red Queen, was a she-dragon ridden by Princess Alyssa Targaryen[1] and later Princess Rhaenys Targaryen.",

"History" : "By 75 AC, Meleys resided in the Dragonpit in King's Landing, never ridden before. That year, the newly married Princess Alyssa Targaryen decided to become a dragonrider. She initially wished to claim Balerion, but the dragonkeepers convinced her that he was too old and slow, and that she would prefer a swifter mount. Alyssa claimed Meleys, and afterwards rarely stayed away from the Dragonpit for long. The dragon was indeed as swift as promised, easily besting the dragons of Alyssa's brothers Aemon and Baelon when they flew together. In 77 AC, Alyssa strapped her nine-day old son Viserys to her chest and took him flying on Meleys. She did the same in 81 AC with her second son, Daemon, within a fortnight of his birth. In 84 AC, Meleys became riderless when Princess Alyssa died some time after a difficult labor. In 87 AC, Meleys was claimed by Princess Rhaenys Targaryen. In 89 AC, Rhaenys flew on Meleys to Highgarden, to accompany King Jaehaerys I Targaryen further on his royal progress to the Shield Islands. When Rhaenys married Lord Corlys Velaryon in 90 AC, she insisted on arriving to the wedding flying on Meleys. Princess Rhaenys rode Meleys during the Dance of the Dragons, on the side of Queen Rhaenyra Targaryen and the blacks, versus King Aegon II Targaryen and the greens. When the Velaryon fleet closed off the Gullet, sailing forth from Dragonstone and Driftmark to block all shipping for Blackwater Bay, the blacks' plan was for Rhaenys to fly overhead on Meleys to keep the greens from attacking the ships with their dragons. In 129 AC, when Rook's Rest was besieged by the greens' army led by Ser Criston Cole, Rhaenys flew Meleys to the castle to lend aid. During the battle at Rook's Rest, Meleys was attacked by Cole's archers and shot with iron bolts by scorpions, which angered her but did not do her harm. In response, she spat fire on the men below, and attacked the knights and horses, killing about 800 men. However, the battle proved to be a ploy when King Aegon and Prince Aemond Targaryen suddenly appeared upon Sunfyre and Vhagar above Rook's Rest. Rhaenys turned to meet the attack, despite the knowledge that Meleys had no hope of success against the two dragons. According to Archmaester Gyldayn, Meleys might have stood a chance against the older Vhagar alone, but not against Vhagar and Sunfyre combined. The dragons met violently in the air, a thousand feet above the field, with their fireballs bursting as bright as the sun. Meleys managed to close her jaw around Sunfyre's neck, just as Vhagar fell upon them, and all three dragons fell from the sky. They crashed to the ground so hard that stones fell from the battlements of Rook's Rest, half a league away. From the ashes, only Aemond and Vhagar rose unharmed. Meleys had half torn one of Sunfyre's wings off, and Aegon suffered broken ribs, a broken hip, and burns that covered half his body. Meleys did not survive the fall, and was ripped to pieces when she hit the ground. A body believed to be Rhaenys Targaryen was found beside the carcass of her dragon, so blackened that she was impossible to identify. The head of Meleys was brought back to King's Landing by the forces of King Aegon II Targaryen and drawn on a cart through the city, a display that awed the smallfolk into silence. According to Septon Eustace, thousands left King's Landing afterward, until Dowager Queen Alicent Hightower ordered the city gates closed and barred."
}