{"Name" : "Meraxes",

"Hatched" : "In 114 – 88 BC (presumably), Dragonstone.",

"Died" : "In 10 AC, Hellholt.",

"Rider(s)" : "Rhaenys Targaryen.",

"Colors" : "Meraxes had golden eyes and silver scales.",

"Description" : "According to Tyrion Lannister, Meraxes was larger than Vhagar but smaller than Balerion, and it is said Meraxes could swallow horses whole. However, the reliability of both claims is uncertain, since Vhagar is the only dragon described by historical sources as grown almost as big as Balerion, and Meraxes died at least several decades younger than Vhagar.",

"History" : "Meraxes was named for a god of the Valyrian Freehold. Her egg hatched on Dragonstone during the Century of Blood. At some point, Meraxes was claimed by Rhaenys Targaryen. Rhaenys first rode Meraxes, demonstrating she was a dragonrider, some time before she married her brother, Aegon. Rhaenys loved to fly, spending more time on dragonback than her brother and sister combined, and was once heard to say that she meant to fly Meraxes across the Sunset Sea to see what lay upon its western shores, After Aegon landed on Westeros and began his conquest, he dispatched his sisters to secure the submission of the nearest castles. Rosby yielded to Rhaenys and Meraxes without a fight. Afterwards, Rhaenys and Meraxes accompanied Orys Baratheon on his mission to subdue Argilac Durrandon, the last Storm King. At the Battle of the Last Storm, the wind and rain forced them to stay grounded, but even on the ground Meraxes slew many, engulfing Argilac's vanguard and the knights of his personal guard in dragonflame. Afterwards, Rhaenys flew Meraxes into the castle of Storm's End to parley with Argilac's daughter Argella. After the stormlanders submitted, Rhaenys flew Meraxes to Stoney Sept, to link up with her siblings, their dragons, and Aegon's army. They advanced south, where all three dragons took part in the decisive Field of Fire – the only battle in which all three of the Targaryen dragons took to the sky at the same time during Aegon's Conquest. Together, Meraxes, Vhagar, and Balerion killed four thousand men, burning them alive. King Mern IX Gardener died, and with him House Gardener. The army was broken, and House Targaryen was victorious. Rhaenys next flew Meraxes to the Trident in the riverlands, where she met with her brother and sister and their dragons, to face King in the North Torrhen Stark. Brandon Snow, the bastard brother of Torrhen, offered to sneak into the Targaryen camp at night to slay the dragons, but the northern king refused the attempt, and instead sent his brother as an envoy, eventually bending the knee to the Targaryens. Afterwards, Rhaenys flew Meraxes to Dorne, to demand their submission. She did not find an easy conquest, as every castle she encountered was empty and abandoned, with only women and children and old men left in the towns and villages. Finally, she and Meraxes arrived in Sunspear, where only the eighty-year-old Meria Martell, Princess of Dorne, remained. Meria told Rhaenys to inform Aegon that Dorne would neither fight nor kneel, and would have no king. Rhaenys warned Meria that the Targaryens would return, and departed Sunspear, leaving Dorne the only unconquered kingdom. The First Dornish War began in 4 AC, when Aegon decided to conquer the kingdom at last. Queen Rhaenys led the first assault on Dorne, seizing Dornish seats as she approached Sunspear, and burning the Planky Town on Meraxes. In 10 AC at Hellholt, an iron bolt from a scorpion went through Meraxes's eye, and the dragon and Rhaenys fell from the sky. In Meraxes's death throes, she destroyed the castle's highest tower and part of the curtain wall. It is not certain whether Rhaenys outlived Meraxes. There are those who say that Rhaenys lost her seat and fell to her death, while others claim that she was crushed to death beneath Meraxes in the castle yard, Following the deaths of Rhaenys and Meraxes, Visenya and Aegon burned every Dornish stronghold at least once (except Sunspear and its shadow city), during a two-year period known as the Dragon's Wroth. Meraxes's skull was later returned to Aegon by a peace delegation. Decades later, the remaining bones were still left in the open field at Hellholt. Along with eighteen other Targaryen dragon skulls, Meraxes's skull hung on a wall in the Red Keep's throne room. After Robert's Rebellion, King Robert I Baratheon had the skulls removed from the throne room, and stored them in a dank cellar. In 284 AC, when Tyrion Lannister visited the capital for the wedding of his sister Cersei to Robert, he observed the skulls in the cellar, including Meraxes's. In 298 AC, Arya Stark encountered the dragon skulls while passing through the Red Keep cellars. In 299 AC, Daenerys Targaryen had the three ships sent to her by Illyrio Mopatis renamed Vhagar, Meraxes, and Balerion, to tell the world that the dragons had returned."
}