{"Name" : "Moondancer",

"Hatched" : "Before 120 AC (Assumed), Dragonstone.",

"Died" : "In 130 AC, The fall of Dragonstone.",

"Rider(s)" : "Baela Targaryen.",

"Colors" : "Slender pale green. Her horns, crest and wingbones were pearl.",

"Description" : "Moondancer was a young she-dragon, ridden by Lady Baela Targaryen.Although in 129 AC Moondancer was not yet considered large enough to carry the thirteen-year old Baela Targaryen upon her back, a year later Baela was able to mount the dragon. At the time, Moondancer was no larger than a warhorse.",

"History" : "Moondancer remained at Dragonstone with her rider, Lady Baela Targaryen, for most of the first two years of the Dance of the Dragons. Around the time of the First Battle of Tumbleton, it was noted that Baela had started riding Moondancer not half a year past, which would be around late 129 AC (whether she began before or after the Battle of Rook's Rest is unclear). In that half year, Baela trained extensively on Moondancer, riding her every day to all parts of Dragonstone. She even rode Moondancer to nearby Driftmark and back. When the corpse of the dragon Grey Ghost was sighted on the far side of the Dragonmont, it was suspected that the dragon known as the Cannibal had killed him. Baela offered to take young Moondancer to hunt him down, boldly arguing that her smaller and more nimble dragon could outmaneuver him. However, Dragonstone's castellan, Ser Robert Quince, felt it wasn't worth the risk, and had Baela confined to her chambers. Unknown at the time, Grey Ghost had not been killed by the Cannibal, but by the badly injured Sunfyre, dragon of King Aegon II Targaryen himself. Sunfyre continued to hide on the other side of the island. When Dragonstone fell to Aegon II Targaryen and his men, Baela was able to evade capture by escaping from her bedchambers as the door was being smashed down. She managed to reach Moondancer in her stable, loosed the dragon's chains, and strapped a saddle onto her. As Aegon II flew Sunfyre over Dragonmont's smoking peak, planning to land triumphantly in the courtyard of the castle, Baela and Moondancer rose up to meet them. The two dragons fought fiercely in the air. The younger, smaller Moondancer was far more nimble than the half-crippled Sunfyre, and she managed to evade his flames, jaws, and claws for a time, while at the same time wounding Sunfyre heavily on his back and malformed wing. Moondancer was blinded when a blast of Sunfyre's flames hit her directly in the eyes. Despite the fire, Moondancer advanced on Sunfyre, slamming into him and falling to the ground with him. Although both dragons survived the fall, upon the ground Moondancer's speed could not defeat Sunfyre's size and weight. The younger dragon was eventually killed by Sunfyre, who then devoured her carcass. Nonetheless, Moondancer had succeeded in mortally wounding her opponent. Sunfyre died in the last month of the year, from wounds received during the battle."
}