{"Name" : "Morning",

"Hatched" : "Between 129 - 130 AC.",

"Died" : "In 136 – 153 AC.",

"Rider(s)" : "Rhaena Targaryen.",

"Colors" : "Morning's scales were pale pink, but with black horns and crest.",

"Description" : "Morning was a she-dragon which hatched during the Dance of the Dragons. It belonged to Lady Rhaena Targaryen, the daughter of Prince Daemon Targaryen and Lady Laena Velaryon.",

"History" : "Morning hatched during the Dance of the Dragons from one of the three eggs that Lady Rhaena Targaryen brought with her to the Vale, a clutch produced by Rhaenyra's she-dragon Syrax. News of Morning's birth reached the greens around the start of 131 AC, greatly troubling them, as they had lost all of their dragons during the fighting. Dowager Queen Alicent Hightower feared that the smallfolk would consider the blacks as more legitimate, due to Morning's birth. The war lasted only for another half a year, during which time Morning was still too young to be ridden.Morning was one of four dragons to survive the Dance of the Dragons - and the only one still controlled by the Targaryens. Rhaena and Morning arrived in King's Landing after the death of King Aegon II Targaryen in mid-131 AC. While the smallfolk became ecstatic at the sight of Morning, Rhaena's brother, King Aegon III Targaryen, who was fearful of dragons, paled when he saw the dragon for the first time and commanded his guards to get that wretched creature out of my sight, During their time at King's Landing, Rhaena would often visit throughout the city, usually with Morning, who was still small and young, coiled about her shoulders like a stole. By the start of 134 AC, Morning had grown much and had made her lair in the Dragonpit. On the third day of the third month of 135 AC, Rhaena rode upon the back of Morning for the first time. They returned to the Dragonpit after circling once around the city, and subsequently went forth every day, flying farther each time. Rhaena landed Morning inside the Red Keep on only one occasion, where Queen Daenaera Velaryon was delighted by the dragon, but King Aegon III again refused to go and see the dragon. Shortly thereafter, Rhaena traveled on the dragon's back to Dragonstone, where, according to Rhaena, she and her dragon would be more welcome. When Rhaena's husband, Ser Corwyn Corbray, was killed in the Vale that same year, Rhaena's sister Baela traveled to Dragonstone to ensure that Rhaena would not use Morning to attempt to avenge her husband's death.When in 136 AC preparations were being made for a royal progress to he held after King Aegon III turned sixteen, Rhaena desired to accompany the progress on Morning, but this suggestion was delicately deflected by the Hand of the King and the council of regents."
}