{"Name" : "Quicksilver",

"Hatched" : "In 7 AC, Dragonstone.",

"Died" : "In 43 AC, south of the Gods Eye.",

"Rider(s)" : "Aenys I Targaryen, Aegon Targaryen.",

"Colors" : "Coloring of her body is not stated in the books, her name as well as the coloring of her fire implies that Quicksilver's scales were silver.",

"Description" : "Quicksilver was the she-dragon of King Aenys I Targaryen and his son, Prince Aegon Targaryen, In 43 AC, Quicksilver was a quarter the size of Balerion. Her fireballs were pale white in color.",

"History" : "As a hatchling, Quicksilver bonded with infant Prince Aenys Targaryen, who had also been born in 7 AC. The health of Aenys, who had been sickly from birth, quickly improved after this. This also ended the rumors that Aenys had been fathered by someone other than King Aegon I Targaryen. Both prince and dragon thrived together, and Quicksilver became beloved to Aenys. Though Aenys loved to ride horses, Quicksilver was his favorite mount. In 23 AC, Aenys flew upon Quicksilver to Sunspear in Dorne to attend the feast held to celebrate the tenth anniversary of the peace between Dorne and the Iron Throne. Aenys succeeded his father Aegon I Targaryen as king in 37 AC. At his father's death, he was at Highgarden with Quicksilver, and flew upon the dragon to Dragonstone to attend his father's funeral. He was with Quicksilver at Riverrun when rebellions broke out later that same year. When word reached them that the outlaw called Harren the Red had killed Lord Gargon Qoherys of Harrenhal and claimed the castle for himself, Lord Tully urged Aenys to mount Quicksilver and descend on Harrenhal as Aegon I had done during the Conquest. Aenys refused. King Aenys I Targaryen died in early 42 AC. Quicksilver lit his funeral pyre at Dragonstone, and the dragons Silverwing and Vermithor added their flame to hers. Shortly thereafter, Aenys's half-brother Maegor I Targaryen claimed the Iron Throne, usurping it from his nephew Prince Aegon Targaryen. When Maegor took the throne, Prince Aegon and his wife Princess Rhaena Targaryen were besieged at Crakehall (and later protected at Casterly Rock), but both Quicksilver and Rhaena's dragon Dreamfyre were in King's Landing. While King Maegor was in Oldtown for half a year in 43 AC, Aegon and Rhaena took note of his long absence from the capital. They managed to successfully infiltrate King's Landing with the help of several collaborators within the city, though they knew they dare not seize the throne as they lacked the strength to hold it. They had come for dragons — Rhaena was reunited with Dreamfyre, and Aegon finally claimed a dragon, his father's Quicksilver. They had entered the city in a mule-drawn wagon, but left it flying on dragonback. In 43 AC, Prince Aegon attempted to win back the throne that by rights was his, returning to the westerlands and riverlands to assemble an army. His allies gathered at House Piper's Pinkmaiden Castle. Aegon, mounted on Quicksilver, descended from the sky to denounce Maegor as a tyrant and usurper, and called upon all honest men to rally to his banners. Fifteen thousand men joined the rebellion, and marched through the riverlands towards King's Landing, led by Aegon the Uncrowned on Quicksilver. Royalist armies marched toward him from three directions, and Aegon's army was larger than any of the three, but the inexperienced young commander did not want to attack and defeat each one separately, and continued towards the capital. Just south of the Gods Eye, Prince Aegon found a force of crownlands men blocking his path. Aegon ordered a charge against the hill where the Kingslanders had gathered, hoping to shatter them before the other hosts could flank him. Aegon mounted Quicksilver, intending to lead the attack. But he had only taken off when King Maegor appeared from the south upon the back of his dragon Balerion, four times as large as Quicksilver. For the first time since the Doom of Valyria, dragon fought dragon in the sky, while the Battle Beneath the Gods Eye was fought below. Quicksilver was no match for the older, fiercer dragon, and her pale white fireballs were overcome by Balerion's masses of black flame. Then Balerion fell upon Quicksilver from above, grabbed her neck in his jaws, and ripped one of her wings from her body. Quicksilver fell to her death, along with Prince Aegon."
}