{"Name" : "Rhaeghal",

"Hatched" : "In 299 AC, Dothraki sea.",

"Died" : "Alive.",

"Rider(s)" : "Commanded by Daenerys Targaryen.",

"Colors" : "Rhaegal is a green and bronze dragon. His dark scales and wings are jade-green, and his eyes are described initially as molten gold and later as bronze. The dragon has black claws and teeth like black needles. His dragonflame has been described as being yellow, red and yellow, and orange-and-yellow fire shot through with veins of green.",

"Description" : "Rhaegal is one of the dragons born on the Dothraki sea, along with Drogon and Viserion. Commanded by Daenerys Targaryen, he is named for her late brother, Prince Rhaegar Targaryen.",

"History" : "At the wedding of Daenerys Targaryen to Khal Drogo by Pentos, she receives multiple bride gifts, including three petrified dragon eggs from Magister Illyrio Mopatis. Rhaegal's egg is a deep green, with burnished bronze flecks that comes and goes depending on how Daenerys turns it. The maegi Mirri Maz Duur proclaims that in order to bring new life one has to give life. Daenerys burns Drogo's body, along with Mirri herself and the three eggs, birthing Rhaegal, along with his brothers, Viserion and Drogon. In the red waste, Daenerys names the green dragon Rhaegal, after her late brother Rhaegar. At Vaes Tolorro, Rhaegal tries to fly in Daenerys's tent and screams after landing on her carpet. When Daenerys arrives in Qarth, Rhaegal and the other dragons are a marvel in the ancient city. Rhaegal is with Daenerys when she receives the news of the death of King Robert I Baratheon from Quhuru Mo. Daenerys takes Rhaegal on her shoulder when she petitions the Pureborn in the Hall of a Thousand Thrones and then travels with Xaro Xhoan Daxos in his palanquin. Rhaegal grows to the size of a small dog, and he flies above as Daenerys sails toward Astapor. When Daenerys has the Unsullied attack the Good Masters in the sack of Astapor, Jhiqui frees Rhaegal to attack the slavers. Rhaegal hisses at Grazdan mo Eraz when Daenerys meets with the envoy outside Yunkai. The green dragon belches flame when an angry Daenerys confronts Ser Jorah Mormont and Ser Barristan Selmy, After conquering Meereen and claiming the Great Pyramid, Daenerys finds Rhaegal sunning himself on the pyramid's terrace. Rhaegal and the other dragons begin to misbehave, with Rhaegal snapping at Irri. His head grows larger than a horse's. When Drogon allegedly kills the young girl Hazzea outside Meereen, Daenerys has Viserion and Rhaegal chained in a makeshift dragon pit in the Great Pyramid. Rhaegal fights fiercely while being removed from the terrace, and six men are burned during the three days it takes to move the green dragon.[15] Rhaegar becomes more savage during his confinement. Daenerys introduces Prince Quentyn Martell to Rhaegel and Viserion in the pit. After Daenerys disappears on Drogon's back from Daznak's Pit, Quentyn attempts to steal a dragon after enlisting the help of the Windblown. Quentyn attempts to dominate Viserion with a whip, but, unbeknownst to the knight, Rhaegal is behind him. The green dragon looses his dragonflame  and fatally burns Quentyn. Once loosed from the pit, Rhaegal attempts to make his lair atop the pyramid of Hazkar, killing many slavers there, but the building collapses into ruin. Rhaegal then makes his new lair in the pyramid of Yherizan. Ser Barristan Selmy notes that thus far, Rhaegal has shown himself to be more dangerous than his brother Viserion. As the second siege of Meereen begins, Rhaegal and Viserion are both drawn to the battle. Tyrion Lannister sees Rhaegal circling above the bay, banking and turning as longships and galleys clash and burn below him. When Ben Plumm and his companions come galloping back from the camp of Malazza, the Girl General, Rhaegal is still prowling, soaring in wide circles above the city and the bay on great green wings."}