{"Name" : "Seasmoke",

"Hatched" : "In or before 101 AC.",

"Died" : "In 130 AC, Tumbleton.",

"Rider(s)" : "Laenor Velaryon, Addam of Hull.",

"Colors" : "Pale silver-grey.",

"Description" : "Seasmoke was a dragon ridden at first by Ser Laenor Velaryon and later by the dragonseed, Addam of Hull, Seasmoke was a pale silver-grey dragon. It was of fighting size during the Dance but still a young dragon and nimbler in the air than his older brothers. He was of comparable size to Tessarion, who was about three times smaller than Vermithor, and not as fearsome a beast as him in comparison.",

"History" : "By 101 AC, Seasmoke was a young dragon bonded with Laenor Velaryon though he had yet to ride him. Seasmoke was Laenor's pride and passion. After Laenor's death in 120 AC, Seasmoke made its lair in the Dragonmont on the island of Dragonstone and remained riderless for almost a decade, During the Dance of the Dragons, Laenor's son, Prince Jacaerys Velaryon, desired new dragonriders for his faction. He offered knighthood, lands, and riches to whoever could claim the riderless dragons. Most of the attempts to claim a dragon ended in death or heavy burns in an event remember as the Red Sowing. In one of those attempt, Seasmoke killed Ser Steffon Darklyn, one of Rhaenyra Targaryen's Queensguard. Later, the fifteen-year-old Addam of Hull was able to claim and ride Seasmoke, however. Addam used Seasmoke to protect his younger brother, Alyn of Hull, from Sheepstealer during his attempt to claim him. Addam and Alyn were declared to be bastard sons of the late Laenor, though it was rumored that they where truly bastards of Laenor's father, Lord Corlys Velaryon of Driftmark. Either way Addam's blood relation to Seasmoke's previous rider may have been a factor in it accepting him. Corlys convinced Queen Rhaenyra to remove the taint of bastardy to Addam and Alyn, thus Addam of Hull became Ser Addam Velaryon, heir of Driftmark. Seasmoke was one of the five dragons participating in the Battle in the Gullet against the Triarchy,[5] and also took part in the Fall of King's Landing. Once it was decided that Queen Rhaenyra would remain in King’s Landing, Syrax, Seasmoke, and Tyraxes were expected to suffice for the defense of the city, and the rest of the dragonriders went to battle. Seasmoke was kept in the Dragonpit while in the capital. With the Two Betrayers on their minds, many voices in the black council questioned Ser Addam’s loyalty. Only the Queen's Hand, Lord Corlys Velaryon, spoke in defense of the dragonseed, remarking that Ser Addam and his brother Alyn were “true heirs” and worthy of Driftmark. The Hand’s impassioned protests were in vain and Queen Rhaenyra, suspecting a turncloak, commanded Ser Luthor Largent to arrest Addam in the Dragonpit. Ser Addam, who had been forewarned, managed to make his escape flying away with Seasmoke, fleeing before he could be put to the question. By ordering the arrest of Addam, the queen lost not only a dragon but her Queen’s Hand as well. Corlys was beaten and imprisoned for warning Addam. As the Second Battle of Tumbleton was put into motion, Ser Addam was determined to prove that all bastards need not be turncloaks. Ser Addam attacked Tumbleton at night, taking the greens completely unawares. As chaos ensued Addam could see the battle turning into a rout below him. By this time, two of the enemy dragonriders, Hugh Hammer and Daeron the Daring, were dead; although Addam could not have known that, he could see Vermithor, Silverwing and Tessarion. The riderless Tessarion took flight and Addam turned his dragon to meet her. Both being young dragons they moved fast and nimbly as they fought. The fight ended when the riderless, enraged Vermithor rose into the sky and set about indiscriminately killing those on the ground. As the Bronze Fury wreaked carnage, Seasmoke fell upon him, driving him shrieking into the mud. According to Archmaester Gyldayn, Addam must have felt duty bound to protect his men on the ground, though surely he knew in his heart Seasmoke could not match the older dragon. The riderless Blue Queen soon joined the fray and all three dragons fought to the death on the ground amidst mud and blood and smoke. Vermithor killed Seasmoke when he locked his teeth into his neck and ripped his head off. He attempted to take flight with his prize still in his jaws but his tattered wings could not lift his weight. After a moment he collapsed and died. Vermithor had also mortally wounded Tessarion, who died soon afterwards. After the Second Battle of Tumbleton, Lord Unwin Peake ordered a retreat, taking the remnants of the great host that Prince Daeron and Lord Ormund Hightower had led from Oldtown. The accused turncloak Addam Velaryon had saved King’s Landing from the queen’s foes at the cost of his own life. Seasmoke and Vermithor's remains became a tourist attraction at the rebuilt Tumbleton."
}