{"Name" : "Sheepstealer",

"Hatched" : "In or after 35 AC, Dragonstone.",

"Died" : "In 136 – 153 AC (presumably).",

"Rider(s)" : "Nettles.",

"Colors" : "Mud brown.",

"Description" : "Sheepstealer was a wild male dragon during the Dance of the Dragons with a taste for mutton. He lived at the back of Dragonmont and would hunt between Driftmark and Wendwater. The smallfolk of Dragonstone named him for a self-evident reason. At the start of the Dance of the Dragons, he was one of three wild dragons living on Dragonstone.",

"History" : "Sheepstealer's coloring was an ugly mud brown. He was not aggressive towards humans unless provoked, but could be vicious and ill-tempered. He had a taste for mutton. While he devoured the occasional sheep dog, he never harmed a shepherd. Grand Maester Munkun described Sheepstealer and his rider Nettles as a skinny brown girl on a skinny brown dragon, though it is also noted that Munkun never actually saw Nettles.[5] Thus the accuracy of Munkun's description is unknown. Sheepstealer was not a young dragon by the time Nettles bonded with him, well over fifty years old. On the other hand, Dreamfyre was even older than Sheepstealer, but was consistently described as slender - thus it's possible that Sheepstealer could have both been large and of slender build, Sheepstealer's dragon egg hatched when the Old King Jaehaerys I Targaryen was still young.[2] It is unclear if that means in the early years of Jaehaerys's reign, thus in or after 48 AC, or generically during his youth, thus in or after 35 AC (34 AC is not counted, since it is implied Sheepstealer was younger than Vermithor).[5][6] Sheepstealer made his lair in the caverns of the Dragonmont on Dragonstone, and would hunt sheep as far as on Driftmark and at the Wendwater. Sheepstealer went unclaimed by any rider in his youth, which made him more and more unused to the presence of men and harder to claim with each passing year. Eventually he spent over seven decades living wild on Dragonstone, snatching sheep from pastures across Blackwater Bay. During the early phase of the Dance of the Dragons, Jacaerys Velaryon called upon any potential dragonseeds to try and claim a dragon to ride. During this event, which became known as the Sowing, Sheepstealer was one of four dragons who people attempted to mount, and the only one who had never had a rider before. In the process, Sheepstealer killed more candidates than the other three dragons (Vermithor, Seasmoke, and Silverwing) combined. Silver Denys, who claimed to be a descendent of King Maegor I Targaryen, had his arm torn off by Sheepstealer when he tried to master the dragon, and Alyn of Hull was burned by the dragon when he made his attempt. A bastard girl named Nettles eventually managed to tame the dragon, through a cunning method. She left out a freshly killed sheep for the dragon every morning, causing the dragon to grow accustomed to her presence, until he allowed her to mount him.[4] Along with Rhaenyra Targaryen's other dragonriders, Nettles and Sheepstealer took part in the Battle of the Gullet and the rapid capture of King's Landing,[4] after which Sheepstealer made his lair in the Dragonpit. Nettles and Sheepstealer joined Prince Daemon Targaryen and his dragon Caraxes in hunting Aemond Targaryen and Vhagar along the Trident. They remained at Maidenpool, from where they continued their search every morning. When Queen Rhaenyra named Nettles a traitor, Nettles left Maidenpool with Sheepstealer early in the morning, after feeding Sheepstealer the largest black ram present at the castle. The dragon and its rider were last seen flying over the Bay of Crabs. When King Aegon II Targaryen regained the Iron Throne after Rhaenyra's death, there were reports that Sheepstealer had been seen at Crackclaw Point and the Mountains of the Moon. In 134 AC, during the reign of King Aegon III Targaryen, Ser Robert Rowan led a royal army to the Vale of Arryn to support Ser Joffrey Arryn. Robert's men encountered Sheepstealer and a ragged Nettles in a cave, and in the ensuing fight sixteen men were slain and threescore more were wounded. Nettles and her dragon were last seen flying deeper into the Mountains of the Moon. An offshoot clan of the Painted Dogs in the Vale came to worship a fire-witch, to whom they would send their boys with gifts for her. In exchange, they would face the flames of her dragon to prove their manhood. This offshoot clan was considered to be one of the most savage of the mountain clans, and stories are still told about this fire-witch to this day. Some of the maesters of the Seven Kingdoms believe that this practice was the origin of the tradition held nowadays by the Burned Men, where young men must give some part of their body to the fire to prove they have the courage to be a man."
}