{"Name" : "Silverwing.",

"Hatched" : "In 36 – 42 AC.",

"Died" : "In 136 – 153 AC.",

"Rider(s)" : "Alysanne Targaryen, Ulf White.",

"Colors" : "Silverwing has been described as a silvery dragon.",

"Description" : "Silverwing was a silvery she-dragon of House Targaryen. She was ridden by Queen Alysanne Targaryen, and later by Ulf White during the Dance of the Dragons,  She was considered relatively docile and friendly to strangers. Silverwing often coiled with Vermithor.",

"History" : "According to legend, Silverwing hatched from a dragon's egg that had been placed in the cradle of Alysanne Targaryen by her sister Rhaena, in 36 AC. In 42 AC, at Dragonstone, Silverwing contributed her flames to the funeral pyre of King Aenys I Targaryen, together with the dragons Quicksilver and Vermithor. In 44 AC, Alysanne, her brother Jaehaerys, and their mother Alyssa Velaryon resided on Dragonstone as the hostages of Dowager Queen Visenya Targaryen. In the chaos following Visenya's death of natural causes that year, Alysanne, Jaehaerys, and Alyssa fled the island, along with Alysanne's dragon Silverwing and Jaehaerys's dragon Vermithor. Silverwing had accepted Alysanne as her rider by 48 AC. After King Maegor I Targaryen's death, Alysanne flew Silverwing to King's Landing, together with her brother Jaehaerys and her sister Rhaena upon their dragons, Vermithor and Dreamfyre, so Jaehaerys could claim the Iron Throne. In 49 AC, Jaehaerys and Alysanne flew Vermithor and Silverwing from the Red Keep to Dragonstone to secretly marry, without the permission of the Queen Regent Alyssa Velaryon or the Hand of the King Rogar Baratheon. Dragonstone remained their refuge for the remainder of the king's minority. During the course of Jaehaerys's long reign, he spent much time guesting with lords or holding audience in towns and villages. He would fly there upon Vermithor, with Queen Alysanne soaring on Silverwing beside him. In 54 AC, Alysanne flew Silverwing to Oldtown for the funeral of the High Septon. The dragon alighted atop the Hightower, fanning the flames of the tower's beacon with her wings, which made the city gasp. Later that year, Alysanne and Jaehaerys flew Silverwing and Vermithor to Storm's End so that they could be with their mother Alyssa when she died in labor. Still later, Alysanne flew Silverwing to Dragonstone, to comfort her sister Rhaena in her grief for the deaths of her companions. At the end of the year, when Rhaena flew to King's Landing in search of her missing daughter Aerea, Silverwing and Vermithor rose up and roared at Dreamfyre's arrival, and those watching were afraid the dragons would fight. In 56 AC, when the Targaryens began to house dragons in the Dragonpit, Silverwing and Vermithor did not join Balerion and three younger dragons, but instead remained at the Red Keep, where they would be close to their riders. In 58 AC, Alysanne flew Silverwing to White Harbor, Winterfell, and later the Wall, on a planned royal progress that Jaehaerys was initially unable to accompany due to duties in King's Landing. In White Harbor, tens of thousands of northerners turned out to cheer Alysanne and gape at Silverwing with awe and terror. At Winterfell, Lord Alaric Stark refused to allow Silverwing within his walls, citing the burning of Harrenhal. Later, Alysanne's charm convinced him to approach Silverwing, though warily. Alysanne grew restless waiting for Jaehaerys to arrive at Winterfell, and flew Silverwing to the Wall, stopping at Last Hearth and several smaller keeps (including Queenscrown) on the way. At Castle Black, the men of the Night's Watch were as awed by Silverwing as the people of White Harbor had been, but Alysanne noted that Silverwing does not like this Wall. The dragon would hiss and snap at every chilly gust of wind coming down from the Wall. Alysanne attempted on three occasions to fly Silverwing north beyond the Wall, but the dragon refused and veered south every time. Alysanne wrote to Jaehaerys that she was troubled by the fact that Silverwing refused to fly over the Wall, despite never refusing her commands previously. Alysanne later flew Silverwing back to Winterfell to reunite with Jaehaerys, and from there they flew to Torrhen's Square, Barrowton, and back to King's Landing. In 82 AC, Alysanne flew Silverwing to the Eyrie, to be with her daughter Daella Targaryen during her first pregnancy and childbirth. In 92 AC, Alysanne quarreled with Jaehaerys over his decision to pass over his granddaughter Rhaenys, the only heir of his deceased eldest son Aemon, in favor of his son Baelon, in the line of succession. Alysanne departed King's Landing and flew to Dragonstone on Silverwing, where she remained apart from Jaehaerys for two years, in an estrangement that became known as the Second Quarrel. The couple reconciled in 94 AC, with the help of their daughter, Septa Maegelle, though they never reached accord on the succession. In 93 AC, Silverwing was ridden by Alysanne for the last time. Alysanne wept as she climbed painfully from her dragon's back. Silverwing became riderless upon Alysanne's death in 100 AC, Silverwing returned to Dragonstone after Alysanne's death, where she made her lair in one of the smoking caverns of the Dragonmont.[15] She remained there, riderless, until 129 AC, during the Dance of the Dragons.[16] When Prince Jacaerys Velaryon decided that his mother Queen Rhaenyra Targaryen's faction, the blacks, needed more dragonriders, he sent out a call for men to claim one of the riderless dragons upon Dragonstone, in an event known as the Sowing of the Seeds. The court fool Mushroom relates a story in his Testimony about his attempt to mount Silverwing, considered to be the most docile of the masterless dragons. It is an amusing if unlikely tale, which ends with Mushroom running across the ward of Dragonstone with the seat of his pants on fire, and nearly drowning when he leaps into a well to quench the flames. Of the four riderless dragons who were claimed during the Sowing, Silverwing is the only one who is not described as killing any man who attempted to ride her. Ultimately, Silverwing accepted a dragonseed man-at-arms called Ulf the White as her new rider. Ulf rode Silverwing to battle in the Battle in the Gullet. Along with Vermithor, Sheepstealer, Vermax, and Seasmoke, Silverwing descended upon the ninety warships sailing under the banners of the Three Daughters.The first battle at Tumbleton, as depicted by Douglas Wheatley in Fire & Blood, When King's Landing fell to Rhaenyra Targaryen's supporters, Ulf landed Silverwing upon the Hill of Rhaenys, outside of the Dragonpit. In the Dragonpit, Silverwing made a lair before flying off to battle. Ulf rode Silverwing into battle during the first battle at Tumbleton. Ulf and fellow dragonseed Hugh Hammer, who had claimed Vermithor, changed their allegiance, betraying Rhaenyra in favor of Aegon II Targaryen. Silverwing, Vermithor, and Tessarion, the dragon of Aegon II's brother Prince Daeron, let loose their flames upon Tumbleton, which was savagely sacked.Ulf and Silverwing remained with the Hightower host at Tumbleton. Silverwing was kept unchained beyond the town walls, free to fly and hunt. During the Second Battle of Tumbleton, an army of four thousand men strong, led by Ser Addam Velaryon upon the dragon Seasmoke, surprised the Hightower host at Tumbleton with their night-time attack. Ulf slept through the battle, but even without a rider Silverwing took to the sky during the battle. At one point, a crossbowman shot a bolt at the dragon. Silverwing avoided further battle and instead circled the battlefield for hours. She descended only again the next day, after the sun had gone down, and landed between the slain Vermithor, Seasmoke, and Tessarion. The singers claim that Silverwing attempted to lift Vermithor's wing on three occasions, but Archmaester Gyldayn considers this most likely to have been a fable. When the sun rose again, Silverwing began to fly listlessly across the field, where she fed on the burned carcasses of men and animals. Silverwing's rider, Ulf White, insisted he should become the new king of the Seven Kingdoms, as King Aegon II was missing, and Prince Aemond and Daeron had died. When Ser Hobert Hightower, one of the Caltrops, gave Ulf poisoned wine, Silverwing became riderless once again. At Tumbleton, Lord Unwin Peake offered a thousand golden dragons to any knight of noble birth able to claim Silverwing. Out of the three men who came forth, the first had his arm torn off and the second burned to death. The third man then changed his mind. Silverwing was one of only four dragons still alive at the end of the Dance of the Dragons. Although accustomed to men, Silverwing became wild during the reign of Aegon III Targaryen, and made her lair on a small island in Red Lake in the northwest of the Reach. When seeking a new dragon to replace the late Sunfyre, Aegon rejected Lord Borros Baratheon's suggestion of Silverwing, as he was too weak to travel across the war-torn country to Red Lake or mount a grown dragon. Silverwing continued living at Red Lake during the regency of King Aegon III Targaryen."
}