{"Name" : "Sunfyre",

"Hatched" : "Before 120 AC, Dragonmont.",

"Died" : "In 130 AC, Dragonstone.",

"Rider(s)" : "Aegon II Targaryen.",

"Colors" : "Sunfyre had gleaming gold scales, which shone like beaten gold in the sunlight, and pale pink wing membranes. His flames were golden as well.",

"Description" : "Sunfyre, also known as Sunfyre the Golden, was a male dragon ridden by King Aegon II Targaryen. The three-headed Targaryen dragon in the arms of Aegon was made golden to honor Sunfyre.",

"History" : "Huge and heavy, the splendid Sunfyre was a formidable fighter despite his youth. Sunfyre's egg hatched on Dragonstone. Although his exact year of birth has not been stated, he was described as being a young dragon in 120 AC and 129 AC. Sunfyre is known to have been older than Tessarion. Although it is unknown when exactly Prince Aegon Targaryen claimed Sunfyre as his mount, he is known to have been claimed by the prince by 120 AC. King Aegon II Targaryen rode Sunfyre during the Dance of the Dragons, the civil war fought between the greens of Aegon and the blacks of his half-sister, Queen Rhaenyra Targaryen. Ser Criston Cole, Aegon's Hand of the King, lured Princess Rhaenys Targaryen and her dragon, Meleys, into a trap in the battle at Rook's Rest, one of the first major battles of the war, in 129 AC. While Meleys was burning Criston's army of greens besieging the castle, Aegon and his younger brother, Prince Aemond Targaryen, appeared on their own dragons, Sunfyre and Vhagar, and the three beasts fought a thousand feet above the field. When Meleys closed her jaws around Sunfyre's neck, Vhagar fell upon them from above, causing the three dragons to fall to the earth. Although Vhagar rose unscathed, Meleys was slain and Sunfyre had one wing half torn from his body. King Aegon, grievously injured and burned from the encounter, was taken to King's Landing to recuperate. Unable to fly and too huge and heavy to be moved, Sunfyre remained near Rook's Rest to allow him time to heal. Criston stationed men near the dragon to guard him. At first, the dragon fed on the burned carcasses of the slain soldiers, but after those were gone, Criston's men brought Sunfyre calves and sheep to eat. When Walys Mooton, Lord of Maidenpool, reconquered Rook's Rest from Aegon II's forces, he led his bravest men to Sunfyre, hoping to slay the dragon. Enraged by the attacks upon him, Sunfyre fought back with his tail and flames, killing threescore of his attackers, including Walys. Within a fortnight of the attack, Sunfyre had disappeared. Although his wing had healed in an awkward angle, Sunfyre had recovered enough from his battle with Meleys to fly once again. Ser Byron Swann was killed in an attempt to slay a dragon during the war, although sources vary as to which dragon he faced. Septon Eustace wrote that Byron desired to kill Sunfyre, but Archmaester Gyldayn expresses doubt because the golden dragon had gone missing from Rook's Rest. Lord Larys Strong helped King Aegon II Targaryen escape the capital during the fall of King's Landing to the blacks of Queen Rhaenyra Targaryen, and the king then hid in a remote fishing village on the isle of Dragonstone. According to the Crabbs and Brunes, Sunfyre hid in the dark piney woods and caves of Crackclaw Point before eventually making his way to Dragonstone. Gyldayn conjectured of a primal instinct for Sunfyre return to his birthplace, or urge to rejoin his rider, Aegon. Some even suggested that Sunfyre was able to feel Aegon II's urgent need of him. Because of Sunfyre's difficulty flying, Mushroom claimed the dragon was a great golden fire-breathing chicken. Sailors on Nessaria observed two dragons—one of them with golden scales—fighting near the Dragonmont, and the partially-devoured corpse of a wild dragon, the Grey Ghost, was then found near the mountain's base. Ser Robert Quince, castellan of Dragonstone, assumed that the Grey Ghost had been killed by the Cannibal. Intrigued by the mention of the golden scales, however, the disguised Aegon ventured forth with Ser Marston Waters, Tom Tanglebeard, and Tom Tangletongue, and the party found Sunfyre in a hidden lair on the Dragonmont. Aegon flew upon Sunfyre every day, regaining strength, while the Two Toms and Marston sought supporters to help Aegon take Dragonstone from Rhaenyra. Ser Alfred Broome aided in the fall of Dragonstone to Aegon's greens. Lady Baela Targaryen evaded capture, however, and reached her green dragon, Moondancer. When Aegon victoriously flew a still-injured Sunfyre to the castle, Moondancer rose to meet him. Although younger and smaller, Moondancer was quicker than Sunfyre. Moondancer raked Sunfyre's side and attacked his malformed wing, but she was then blinded by a blast of Sunfyre's golden flames. The colliding dragons crashed into the ground, where the larger Sunfyre killed his younger adversary. Aegon broke both of his legs jumping clear, and Baela was taken captive by the greens. The battle with Moondancer left Sunfyre even more injured than he had been before. He was covered in fresh scars along his back, had huge wounds along his neck and scabs on his belly, and had lost his right eye. No longer able to fly, Sunfyre remained in the outer yard where he had fallen, feeding first on the carcass of Moondancer and later on slaughtered sheep. Aegon had Grand Maester Gerardys strangled and disemboweled, allowing Sunfyre to feast upon the legs and innards. Aegon had the maester's head and upper torso put on display at Dragonstone's gatehouse to welcome Rhaenyra for her eventual return, as the queen had fled King's Landing after the Storming of the Dragonpit. When the Violande brought Rhaenyra Targaryen to Dragonstone on the twenty-second day of the tenth moon of 130 AC, she was taken captive by Ser Alfred Broome and the greens. Accounts differ on how the reunion between the half-siblings occurred, the pro-greens Septon Eustace says Rhaenyra laughed when she saw the crippled Sunfyre. Whereas she reflected on the war according to the pro-blacks Mushroom. In the end, Aegon fed his half sister to his dragon, and it is said that Sunfyre only reacted to Rhaenyra after her breast was pricked by Alfred's dagger, with the smell of her blood rousing the dragon. Sunfyre bathed her in a blast of flame before closing his jaws around her arm and shoulder. Sunfyre devoured Rhaenyra in six bites, leaving only her left leg below the shin. Prince Aegon the Younger was forced to watch his mother die, and Elinda Massey allegedly gouged out her eyes in horror. Although King Aegon II initially hoped that Sunfyre might recover enough to fly once again, the dragon weakened and eventually refused to eat. He died from his stinking wounds on the ninth day of the twelfth moon of 130 AC. A weeping Aegon ordered that the captive Baela Targaryen be executed, but he was convinced to spare her life to avoid angering House Velaryon. Aegon II returned to King's Landing to rule precariously. He sent for dragon eggs from Dragonstone, hoping for a new Sunfyre, prouder and fiercer than the last, but was unable to hatch one. Aegon the Elder was soon assassinated by poison and succeeded by Aegon the Younger, who ruled as Aegon III Targaryen."}