{
"Name" : "Syrax",

"Hatched" : "Before 104 AC.",

"Died" : "In 130 AC, the Dragonpit, King's Landing.",

"Rider(s)" : "Rhaenyra Targaryen.",

"Colors" : "Yellow.",

"Description" : "Syrax was a she-dragon. She was ridden solely by Rhaenyra Targaryen. Her name came from a goddess of Valyria. Syrax had yellow scales. She was huge and formidable, but not as fearsome or experienced in battle as Caraxes. She was kept in chains and exceedingly well fed. At the time of the civil war called the Dance of the Dragons, Syrax had not hunted for years.",

"History" : "Rhaenyra first took Syrax as a mount in 104 AC, when the princess was seven years old. Syrax was described as a young dragon at the time, and Rhaenyra herself named her Syrax (after a Valyrian goddess) - strongly implying that Syrax had no previous rider. Syrax laid several clutches of eggs during the reign of Viserys I Targaryen. Her latest clutch was produced just prior to the civil war. One of the eggs from that latest clutch was given to Rhaena Targaryen, Rhaenyra's step-daughter. It is somewhat implied that the dragons of Rhaenyra's sons all hatched from eggs laid by Syrax, though the only definitive information about any dragon parentage is that Rhaena's dragon Morning eventually hatched from one of Syrax's eggs. Following Rhaenyra's difficult stillbirth at the beginning of the war, she was unable to fly on dragonback for a time. However, Rhaenyra recovered enough strength to fly on Syrax, along with her other dragonriders, when they assaulted and captured King's Landing, facing little opposition. In King's Landing, Syrax was kept within the walls of the Red Keep, in a stable in the outer ward that had been emptied of horses and given over for her use. Heavy chains bound her to the ground. The chains were long enough to allow her to move from the stable to yard, but kept her from flying off riderless. The three other dragons belonging to the blacks were kept in the Dragonpit, along with the greens's Dreamfyre. About the same time of the Butcher's Ball, Ser Byron Swann set out to slay a dragon. According to the court fool Mushroom, Byron was killed in an attempt to slay Syrax, a claim confirmed by Ser Byron's squire. However, other sources suggested instead that Byron tried to kill Aemond Targaryen's dragon Vhagar or Aegon II's dragon Sunfyre. Syrax was slain in the aftermath of the Storming of the Dragonpit. Prince Joffrey Velaryon had attempted to mount her to ride to the Dragonpit and save the other dragons from the mob, and perhaps mount his own dragon Tyraxes there. Dragons are not horses, however, and they will only accept one rider during that rider's lifetime. In mid-flight, Syrax shrugged off Joffrey, who fell to his death. Attracted by the bloodshed at the Dragonpit, Syrax flew there. Archmaester Gyldayn noted that Syrax could have simply stayed high in the air and made runs at the mob with her flames, but instead she descended upon the ground, killing dozens with tooth and claw. There are numerous and contradicting accounts about specifically how Syrax died, and Gyldayn does not give them in detail. What is certain, is that Syrax eventually died fighting the rioters."
}