{"Name" : "Tessarion",

"Hatched" : "In or before 120 AC.",

"Died" : "In 130 AC, Tumbleton.",

"Rider(s)" : "Prince Daeron Targaryen.",

"Colors" : "Blue, Dark cobalt wings, copper Scales and Cobalt blue flames.",

"Description" : "Tessarion, also known as the Blue Queen, was a she-dragon ridden by Prince Daeron Targaryen. Tessarion was a beautiful blue she-dragon. Her wings were a dark cobalt, while her claws, crest, and belly scales were the color of bright beaten copper. Her flames were cobalt blue in color as well.By 129 AC, Tessarion was of fighting size. During the Dance of the Dragons, she was the youngest dragon of fighting weight belonging to Aegon II Targaryen's supporters, meaning she was younger than Vhagar, Dreamfyre, and Sunfyre. By 130 AC, Tessarion was one-third in size to Vermithor. A young dragon at the time, Tessarion was nimble in the air.",

"History" : "By 120 AC, Tessarion had bonded with Prince Daeron Targaryen, although Daeron had not yet ridden her at the time. Although unknown when Daeron first flew Tessarion, Daeron had become a dragonrider by 129 AC. During the Dance of the Dragons, Daeron rode Tessarion into the Battle on the Honeywine in the Reach to save Lord Ormund Hightower and his army. Due to their arrival and participation in the battle, the Hightower army was victorious. Daeron and Tessarion remained with the Hightower army as it marched up the Roseroad towards King's Landing, which had fallen to Rhaenyra Targaryen's forces. During this time Daeron flew upon Tessarion ahead of the main column of the army to scout ahead, which proved invaluable to the southron host. Rhaenyra's loyalists often fled at the first glimps of Tessarion, being unwilling to face the dragon's fire in battle. At Tumbleton, a market town on the Mander, the Hightower army met in battle in the First Battle of Tumbleton with a smaller force of supporters of Rhaenyra. Tessarion participated in the battle. Tessarion and her rider remained at Tumbleton with the Hightower army afterwards. There, Tessarion was unchained, free to fly and hunt as she wished. The she-dragon slept in her rider's camp to the west of the town, not a hundred yards from his pavilion.Hugh Hammer, a dragonseed who had claimed Vermithor and who had changed his alliance from the blacks to the greens during the First Tumbleton, decided to make a claim for the Iron Throne after the disappearance of King Aegon II Targaryen and the death of Prince Aemond Targaryen, the Protector of the Realm. He felt secure in his decision as Tessarion, the only dragon of fighting weight with a rider still remaining to the greens, was one-third the size of his own dragon, and far less fearsome. Among the Caltrops, the lords and knights who conspired to kill Hammer and his fellow dragonseed, Ulf the White, Ser Tyler Norcross believed that Tessarion on her own should be enough to retake the Iron Throne, while Lord Unwin Peake argued that their victory would be more certain if they had the dragons of Hugh and Ulf in their possession as well. Matters came to a head two days later, when a surprise night attack by Addam Velaryon upon Seasmoke started the Second Battle of Tumbleton. Tessarion's rider was killed at the start of the battle. Riderless, Tessarion flew up, shrieking and spitting flame, and met Addam Velaryon and Seasmoke in battle. The dragons rushed one another time and time again and at one point, Tessarion vanished into the clouds, reappearing behind Seasmoke breathing flames. It was said afterward that the fight between Tessarion and Seasmoke seemed to be more a mating dance than a battle. When Vermithor took to the sky, Addam Velaryon turned Seasmoke towards the older dragon. In their struggle, Tessarion suddenly attacked. The battle between the three dragons had a mortal outcome for all. Seasmoke and Vermithor died early, but Tessarion was the last to die. On three occasions did she try to fly again, but failed every time again. By late afternoon the day after the battle, she seemed to be in pain. At the command of Lord Benjicot Blackwood, Billy Burley, Blackwood's best archer, shot three arrows into the dying dragon's eye, killing her."
}