{"Name" : "Tyraxes",

"Hatched" : "In 117 – 120 AC.",

"Died" : "In 130 AC, the Dragonpit.",

"Rider(s)" : "Joffrey Velaryon.",

"Colors" : "Likely to be Black and Red.",

"Description" : "Tyraxes was thriving and growing larger every year, he was slightly smaller than Vermax and Arrax. By the time of the Dance of the Dragons, he had recently being able to fly long distances with its rider, but was not quite big enough for combat yet.",

"History" : "Princess Rhaenyra Targaryen's three eldest sons by her husband, Ser Laenor Velaryon, were Jacaerys (b. 114 AC), Lucerys (b. 115 AC), and Joffrey (b. 117 AC). The rival faction at court who supported her stepmother Alicent Hightower and her children spread the accusation that Rhaenyra's three sons were not really Laenor's, but bastards fathered by Ser Harwin Strong. In an effort to confirm that he considered Rhaenyra and her sons the true heirs to the throne, her father King Viserys I decreed that a dragon egg would be put in the cradle of each of the boys, to bond with the dragons that hatched from them. Those who doubted the paternity of Rhaenyra's sons also doubted that the eggs would ever hatch, but they were quickly disappointed, as each of the eggs soon hatched in turn. The hatchlings were named Vermax (bonded with Jacaerys), Arrax (bonded with Lucerys), and Tyraxes (bonded with Joffrey). The exact date each hatched is not known but the last seems to have hatched by no later than about 120 AC. Joffrey repeatedly begged his mother to ride to war on Tyraxes but she forbade it.  Later on during the war, Jacaerys sent Joffrey and their cousin Rhaena of Pentos to the Vale of Arryn where they would be wards of Jeyne Arryn, the Lady of the Eyrie. Joffrey flew on Tyraxes with Rhaena from Dragonstone to Gulltown, then to the Eyrie. After Rhaenyra took King's Landing from the greens, she recalled Joffrey who flew back to the capital with Tyraxes.[3] During their time in the city, Tyraxes made his lair in the Dragonpit where he retreated during the riots, as would-be dragon slayer rushed after him. Tyraxes killed so many people with its fire that soon the corpses blocked the front entrance to his lair. Then the mob entered from the back entrance which got Tyraxes confused. Several men and one woman claimed to have killed Tyraxes but in the end he strangled himself with his own chains. After death, the membranes of his wings were cut off to make dragonskin cloaks by the Shepherd's followers."
}