{
"Name" : "Vermax",

"Hatched" : "In 114 - 120 AC.",

"Died" : "In 5th day of the 1st moon of 130 AC, The Gullet.",

"Rider(s)" : "Jacaerys Velaryon.",

"Colors" : "Not described in the books (Olive green scales and pale orange wing membranes).",

"Description" : "Vermax was a dragon ridden by Prince Jacaerys Velaryon. Vermax was thriving and growing larger every year. Vermax became ill-tempered when in proximity of snow, ice, and cold.",

"History" : "When Prince Jacaerys Velaryon was young, there were rumors that he was a bastard, fathered by Ser Harwin Strong, instead of his mother Rhaenyra Targaryen's husband, Ser Laenor Velaryon. The rumors were spread by Queen Alicent Hightower and her followers at court. Those who doubted the paternity of Jacaerys and his brothers also doubted that the dragon eggs the boys had been given would ever hatch, but they were quickly disappointed, as each of the eggs soon hatched in turn. The hatchling that bonded with Prince Jacaerys was Vermax. By the time the Dance of the Dragons began, Vermax was big enough to ride. Prince Jacaerys flew north on his back, as a messenger for his mother, Queen Rhaenyra Targaryen, to treat with Jeyne Arryn, the Lady of the Eyrie, Desmond Manderly, the Lord of White Harbor, and Cregan Stark, the Lord of Winterfell. The mission was a success, as all three declared for Rhaenyra and her blacks. Snow, ice, and cold made Vermax irritable, so Jacaerys did not stay in the north for long, despite receiving a warm welcome at Winterfell. In his testimony, Mushroom claims that Vermax laid a clutch of eggs in the depths of the crypts of Winterfell, but this tale is most likely false. Archmaester Gyldayn states it is difficult to tell the sex of a dragon, but that no other source mentions that Vermax ever produced an egg, and dismisses Septon Barth's theory that dragons can change sex as ludicrous. Prince Jacaerys used Vermax in battle, during the Battle in the Gullet. There, Vermax attacked the Triarchy's fleet, and victory seemed at hand. But Vermax flew too low, possibly wounded from a crossbow bolt to the eye or pulled down by a grapnel, and crashed into a burning galley. Jacaerys leapt free and clung to the smoking wreckage of the ship, but was struck by Myrish crossbow quarrels until he sank into the sea, dead."
}