{"Name" : "Vermithor",

"Hatched" : "In 34 AC.",

"Died" : "In 130 AC, Tumbleton.",

"Rider(s)" : "Jaehaerys I Targaryen, Hugh Hammer.",

"Colors" : "Vermithor was a bronze dragon with 'great tan wings'.",

"Description" : "Vermithor, called the Bronze Fury, was a male dragon once ridden by King Jaehaerys I Targaryen.",

"History" : "Vermithor was already a large dragon in 48 AC; only Balerion and Vhagar were larger. By the time of the Dance of the Dragons, Vermithor was almost a hundred years old. Vermithor was a fearsome beast. Accustomed to men and having had a previous rider, by the reign of Aegon II Targaryen Vermithor was tolerant of the presence of people and more accepting of new riders. Vermithor often coiled with Silverwing. According to legend, Vermithor hatched from a dragon's egg that had been placed in the cradle of Prince Jaehaerys Targaryen by his sister Rhaena, in 34 AC. In 42 AC, at Dragonstone, Vermithor contributed his flames to the funeral pyre of King Aenys I Targaryen, together with the dragons Quicksilver and Silverwing. In 44 AC, Jaehaerys, his sister Alysanne, and their mother Alyssa Velaryon resided on Dragonstone as the hostages of Dowager Queen Visenya Targaryen. In the chaos following Visenya's death of natural causes that year, Jaehaerys, Alysanne, and Alyssa fled the island, along with Jaehaerys's dragon Vermithor and Alysanne's dragon Silverwing. Vermithor had accepted Prince Jaehaerys as his rider by 48 AC, when Jaehaerys made his claim for the Iron Throne. Nine days after the mysterious death of King Maegor I Targaryen, Jaehaerys flew to King's Landing upon Vermithor to claim the throne. During his reign, Jaehaerys I and his sister-wife, Queen Alysanne Targaryen, once visited Winterfell with six dragons. After Alysanne grew bored and flew her own dragon Silverwing north to the Wall, Jaehaerys came after her on Vermithor. Vermithor became riderless when Jaehaerys died in 103 AC. Throughout the reign of Jaehaerys's successor, King Viserys I Targaryen, Vermithor had no new rider. During this time, Vermithor remained on the island of Dragonstone and made his lair in one of the smoking caverns of the Dragonmont. In 129 AC, after the start of the Dance of the Dragons, Prince Jacaerys Velaryon decided that his mother's faction needed more dragonriders. Many men attempted to claim a dragon of their own; Lord Gormon Massey attempted to approach Vermithor, who burned him to death. Eventually, Vermithor bent his neck to a blacksmith’s bastard called Hugh Hammer. Hugh rode Vermithor to battle in the Battle in the Gullet. Along with Silverwing, Sheepstealer, Vermax and Seasmoke, Vermithor descended upon the ninety warships sailing under the banners of the Three Daughters. When King's Landing fell to Rhaenyra Targaryen's supporters, Hugh landed Vermithor upon the Hill of Rhaenys, outside of the Dragonpit. In the Dragonpit, Vermithor made a lair before flying off to battle. Hugh rode Vermithor into battle during the first battle at Tumbleton. Hugh and fellow dragonseed Ulf the White, who had claimed Silverwing, changed their allegiance, betraying Rhaenyra in favor of Aegon II Targaryen. Vermithor, Silverwing and Tessarion, the dragon of Aegon II's brother Prince Daeron, let loose their flames upon Tumbleton, which was savagely sacked. As the Hightower host remained at Tumbleton, so did Hugh with Vermithor. With Aegon II missing and Prince Aemond Targaryen dead, Hugh Hammer decided to fulfill his wish for the crown and declared himself king, as he was the rider of the oldest and largest living dragon. During the Second Battle of Tumbleton, an army of four thousand men strong, led by Addam Velaryon upon the dragon Seasmoke, surprised the Hightower host at Tumbleton with their night-time attack. Hugh rushed to mount Vermithor but was stopped by Jon Roxton, one of the Caltrops, who killed Hugh with his Valyrian steel sword Orphan-Maker. Vermithor, now riderless, was still half-asleep and on the ground when two score knights attempted to slay him. They died in their attempt. Wounded and enraged, Vermithor took flight, attacking all those around him. He snatched up a knight who tried to flee before him in his jaws, and burned Lords Piper and Deddings, with their squires, servants, and sworn shields. While Vermithor was only twenty feet above the field, Seasmoke slammed into him from above. The two dragons rolled over the field, so entangled that neither was able to break free. According to Lord Benjicot Blackwood, Seasmoke was no match for Vermithor on account of the older dragon's size and weight. Lord Blackwood believed that Vermithor would have torn Seasmoke into pieces if Tessarion had not entered the fight. The three dragons fought to the death. Vermithor killed Seasmoke when he locked his teeth into the latter's neck and ripped his head off. He attempted to take flight with his prize still in his jaws but his wings were tattered, causing him to be unable to bear the weight. After a moment he collapsed and died. It is said that after dark Silverwing, who had fled into the sky when the battle began, descended to land beside the slain dragons. Later, the singers would tell of how she tried to lift Vermithor’s wing three times with her nose, as if to try and make him fly again. According to Archmaester Gyldayn this is most likely a fable. Vermithor and Seasmoke's remains became a tourist attraction at the rebuilt Tumbleton."
}