{
    
"Name" : "Vhagar",

"Hatched" : "In 52 BC, Dragonstone.",

"Died" : "In 22nd day of the 5th moon of 130 AC (aged 181), the Gods Eye.",

"Rider(s)" : "Visenya Targaryen, Baelon Targaryen, Laena Velaryon, Aemond Targaryen.",

"Colors" : "Bronze with greenish blue highlights and bright green eyes.",

"Description" : "According to Tyrion Lannister, Vhagar was large enough that one could ride a horse down her gullet. It is said that Vhagar's breath was so hot that it could melt a knight's armor and cook him inside. By the time of the Dance of the Dragons, Vhagar was the hardened survivor of a hundred battles, had grown almost as large as Balerion, and was the oldest and largest of the dragons in Westeros. Her roar was so powerful that it could shake the very foundations of Storm's End. No living dragon could match her for size or ferocity.",

"History" : "Vhagar hatched from a dragon egg on Dragonstone during the Century of Blood. She was named after a god of the Valyrian Freehold. At some point, Vhagar was claimed by Visenya Targaryen. Visenya first rode Vhagar, demonstrating she was a dragonrider, some time before she married her brother, Aegon. After Aegon landed on Westeros and began his conquest, Visenya flew Vhagar to Stokeworth, where crossbowmen loosed bolts until the dragon set the roofs of the castle keep ablaze. Following Aegon's first coronation, Visenya, upon Vhagar, accompanied the Targaryen fleet, commanded by Daemon Velaryon, to take Gulltown. In the battle in the waters off Gulltown, the Arryn fleet defeated the Targaryen fleet, sinking one-third of the ships and capturing near as many. Then, Visenya descended, and burned the ships of the Arryn fleet. Visenya then flew to Crackclaw Point with Vhagar, to accept many pledges of fealty from the local lords. She then flew Vhagar to Stoney Sept to link up with her siblings, their dragons, and Aegon's army. They advanced south, where all three dragons took part in the decisive Field of Fire – the only battle in which all three of the Targaryen dragons took to the sky at the same time during Aegon's Conquest. Together, Vhagar, Meraxes, and Balerion killed four thousand men, burning them alive. King Mern IX Gardener died, and with him House Gardener. The army was broken, and House Targaryen was victorious. Visenya next flew Vhagar to the Trident in the riverlands, where she met with her brother and sister and their dragons, to face King in the North Torrhen Stark. Brandon Snow, the bastard brother of Torrhen, offered to sneak into the Targaryen camp at night to slay the dragons, but the northern king refused the attempt, and instead sent his brother as an envoy, eventually bending the knee to the Targaryens. Afterwards, Visenya flew Vhagar back to the Vale, where she landed with her dragon in the inner courtyard of the Eyrie. When Dowager Queen Sharra Arryn reached the courtyard she found her young son, King Ronnel Arryn, sitting on Visenya's knee, staring with wonder at Vhagar. The young king begged his mother for a ride on Vhagar's back. Sharra bent her knee and surrendered, and Ronnel rode on Vhagar thrice about the summit of the Giant's Lance. Following the deaths of Rhaenys and Meraxes in 10 AC at Hellholt in Dorne, Visenya and Aegon burned every Dornish stronghold at least once (except Sunspear and its shadow city) during a two-year period known as the Dragon's Wroth. The Dornish tell a tale that the Targaryens refused to attack Sunspear because they were afraid that Princess Meria Martell had purchased a device from Lys to slay Vhagar and Balerion, but Archmaester Timotty suggests the Targaryens intended to turn the other Dornish houses against the Martells. When King Aegon I died in 37 AC, Vhagar supplied the flames to light the fire of his funeral pyre. In 41 AC, when King Aenys I Targaryen named his eldest son and heir, Prince Aegon, the Prince of Dragonstone at his wedding, Visenya angrily left for Dragonstone. It was said that the moon turned as red as blood when Vhagar passed it. Later that year, when King Aenys arrived at Dragonstone, fleeing the first rebels in the Faith Militant uprising, Visenya asked him to grant her leave to take Vhagar and burn the Starry Sept in Oldtown. Aenys refused. When the king died early in 42 AC, Visenya left Dragonstone within an hour of his death, and flew to Pentos, where her son Maegor lived in exile. After Maegor had claimed the crown on Dragonstone, Visenya accompanied him upon Vhagar and crossed Blackwater Bay to King's Landing. The return of both Vhagar and Balerion to King's Landing set off riots in the city. Prior to Maegor's wedding to Tyanna of the Tower, Visenya flew upon Vhagar to Driftmark to convince Alyssa Velaryon to appear at the wedding. When the Faith Militant continued to resist Maegor's reign, even after the losses they suffered at the Battle of Stonebridge and the Battle at the Great Fork of the Blackwater, Visenya mounted Vhagar and burned the seats of House Blanetree, House Terrick, House Deddings, House Lychester, and House Wayn in the Riverlands within a single night. Maegor flew Balerion to the westerlands, burning the seats of House Broom, House Doggett, House Falwell, House Lorch, House Myatt, and other pious lords who had defied his royal summons. In 43 AC, Maegor and Visenya turned towards Oldtown, threatening to incinerate the Starry Sept in response to the High Septon's condemnation of his polygamous marriages. Only the mysterious death of the High Septon, which allowed Lord Martyn Hightower to open his gates before Balerion and Vhagar, saved the city from dragonflame. Visenya died on Dragonstone in 44 AC, leaving Vhagar without a rider. Vhagar remained unridden for twenty-nine years after Visenya's death, spending much of that time on Dragonstone and later taking residence in the Dragonpit in King's Landing. It was in 73 AC that Prince Baelon the Brave after achieving knighthood, set out to follow his brother Prince Aemon and become a dragonrider claiming Vhagar. Vhagar along with Caraxes and Vermithor burned the Dornish fleet that attempted to invade the Stormlands during the Fourth Dornish War in 83 AC. After the death of Balerion of old age in 94 AC, Vhagar became the last of the three Targaryen dragons who had fought in the Conquest. Vhagar became riderless again, when Prince Baelon passed away in 101 AC. Vhagar's next known rider was Lady Laena Velaryon, who had become a dragonrider before the age of twelve. According to the maester at Driftmark, the seat of House Velaryon, Laena loved to fly. When Laena wed Prince Daemon Targaryen in 115 AC, they flew upon their dragons across the narrow sea to Pentos, Volantis, Qohor, and Norvos. Everywhere they went, huge crowds came to catch a glimpse of Vhagar and Caraxes, Daemon's dragon. After Laena gave birth in 116 AC, Daemon brought both his own dragon and Vhagar back to Westeros. Laena and Daemon grew close with Daemon's niece, Rhaenyra Targaryen, and the three often flew together upon their dragons, Vhagar, Caraxes, and Syrax. Laena died early in 120 AC. It is said that Laena attempted to reach Vhagar in her final hour as to fly one last time, but she did not have the strength. Following Laena's funeral on Driftmark, the ten-year old prince Aemond Targaryen claimed Vhagar as his own dragon. By 129 AC, Vhagar had grown nearly as big as Balerion had been during Aegon's Conquest, and had become the largest living dragon of her time. Prince Aemond flew on Vhagar to Storm's End, so they could win the support of Lord Borros Baratheon for King Aegon II Targaryen. There Aemond met with Prince Lucerys Velaryon, at Storm's End hoping to gain support for his mother Queen Rhaenyra Targaryen. Aemond was forbidden from attacking Lucerys while both were in Borros's castle, but was allowed to follow him outside. After Lucerys rose into the sky on his dragon Arrax, Aemond mounted Vhagar and followed the young prince. The two dragons fought during a great storm over Shipbreaker Bay, and Vhagar quickly overcame Arrax, whose severed head would wash ashore days later, along with the corpse of Lucerys. Aemond would continue to fly Vhagar in battle during the civil war between King Aegon II and Queen Rhaenyra. During the battle at Rook's Rest, Vhagar and Aemond, and King Aegon and Sunfyre, ambushed the dragon Meleys and her rider Princess Rhaenys Targaryen. Meleys was an old and large dragon, and might have stood a chance against Vhagar alone, but died from the combined assault. Vhagar was the only dragon who left the battle reasonably unharmed. The battle against Meleys left Aegon II severely injured, leaving him incapable of rule, and Prince Aemond was appointed regent. Aemond decided that the main threat in the war was Prince Daemon Targaryen, who was massing armies at Harrenhal. Aemond took Vhagar and most of the green forces from King's Landing north to attack Harrenhal, leaving King's Landing with very little defense. When Aemond and Vhagar arrived at Harrenhal, they found the castle undefended and empty, as Daemon had left some time before to attack King's Landing, after having lured Aemond and Vhagar away from the capital. After the Fall of King's Landing, Prince Aemond and Hand of the King Criston Cole no longer agreed on how to proceed during the war. Aemond took Vhagar on a one-man war of revenge. They burned much of the riverlands, starting with every wooden structure in Harrenhal. Vhagar caused more destruction than an entire army, and severely harmed Rhaenyra's supporters in the riverlands - though Aemond's decision to abandon the army under Criston proved to a strategic blunder. Without Vhagar to protect them, Cole's army in the east was later surrounded and destroyed in the Butcher's Ball, leaving the east wide open to Rhaenyra's forces. About the same time of the Butcher's Ball, Ser Byron Swann and his squire set out to slay a dragon. According to Grand Maester Munkun, Byron was killed in an attempt to slay Vhagar, in an effort to end Aemond's raids across the riverlands. However, this claim is disputed, being instead more probable that Byron tried to kill Rhaenyra Targaryen's dragon Syrax. Aemond and Vhagar continued the destruction of the riverlands and they became the terror of the Trident. Daemon Targaryen, on his dragon Caraxes, and the dragonseed Nettles, on the dragon Sheepstealer, were sent to hunt Aemond. They were allowed to use Maidenpool as their base, as Lord Manfryd Mooton feared an attack from Vhagar, and found himself safer this way. Daemon and Nettles unsuccessfully searched together for Vhagar, who continued to terrorize the riverlands. After the First Battle of Tumbleton, Daemon had word sent out that he and Caraxes would await Aemond and Vhagar at Harrenhal. On the fourteenth day of Daemon's vigil at Harrenhal, Vhagar appeared in the sky, carrying Aemond and his lover Alys Rivers. Aemond left Alys in the castle's yard, and both dragons and their riders launched into the air. All four were killed in the ensuing Battle Above the Gods Eye, when the dragons locked together, Caraxes's jaws closed around Vhagar's neck, Daemon leapt from his dragon to Vhagar to put Dark Sister through Aemond's eye, and the dragons crashed into the lake. Some years after the end of the Dance, Vhagar's body was recovered, with Aemond's armored bones still chained to the saddle. Vhagar was one hundred and eighty-one years old when she died, on the twenty-second day of the fifth moon of 130 AC.Along with eighteen other Targaryen dragon skulls, Vhagar's skull hung on a wall in the Red Keep's throne room. After Robert's Rebellion, King Robert I Baratheon had the skulls removed from the throne room, and stored them in a dank cellar. In 284 AC, when Tyrion Lannister visited the capital for the wedding of his sister Cersei to Robert, he observed the skulls in the cellar, including Vhagar's. In 298 AC, Arya Stark encountered the dragon skulls while passing through the Red Keep cellars. In 299 AC, Daenerys Targaryen had the three ships sent to her by Illyrio Mopatis renamed Vhagar, Meraxes, and Balerion, to tell the world that the dragons had returned."}
