{
"Name" : "Viserion",

"Hatched" : "In 299 AC, Dothraki Sea.",

"Died" : "Alive",

"Rider(s)" : "Owened by Daenerys Targaryen.",

"Colors" : "scales are cream, but his horns, wing bones and spinal crest are gold colored. Teeth are shining black daggers. Claws are black and sharp. Eyes are two pools of molten gold, and his flame is pale gold shot through with red and orange.",

"Description" : "Viserion is one of the dragons born in the Dothraki Sea, along with Drogon and Rhaegal. Commanded by Queen Daenerys Targaryen, he is named for her brother, Prince Viserys Targaryen. Viserion has a roar that would send a hundred lions running. Although his true color is cream, he is often referred to as the white dragon. He knows his name. Wisps of smoke emit from his nostrils. When wounded, his blood glows gold and red. ",

"History" : "At the wedding of Daenerys Targaryen to Khal Drogo, she receives multiple bride gifts, including three petrified dragon eggs from Magister Illyrio Mopatis. Viserion's egg is colored pale cream streaked with gold. The maegi Mirri Maz Duur proclaims that in order to bring new life one has to give life. Daenerys burns Drogo's body, along with Mirri Maz Duur herself and the three eggs, birthing Viserion, along with his brothers, Drogon and Rhaegal. When Daenerys calls her people together and mounts her silver mare, she is wearing her lion pelt, and has Viserion on her shoulder. He sinks his sharp black claws into the lion's mane, and coils his tail around her arm, as she gives the order for her khalasar to follow the Red Comet. When Daenerys arrives in Qarth, Viserion and the other dragons are a marvel in the ancient city. When Daenerys receives the news of the death of King Robert Baratheon, the Usurper, Viserion is on her shoulder. He flaps wings the color of cream, stirring the air. Viserion is about the size of a small dog. At Astapor, when Daenerys has the Unsullied attack their former masters, Irri frees Viserion to attack the Good Masters. Viserion is fond of the sellsword captain Ben Plumm, and sometimes lands on Plumm's shoulder. While in Meereen, Viserion and the other dragons misbehave and start to grow wild. Viserion sets Reznak mo Reznak's tokar on fire. As Daenerys walks out onto the terrace of the Great Pyramid, Viserion senses her disquiet, as she is concerned about the Sons of the Harpy. She finds him lying coiled around a pear tree, with his head resting on his tail. She watches Viserion take off and fly in widening circles, until he is lost to her sight beyond the muddy waters of the Skahazadhan. When Drogon kills a young girl outside Meereen, Daenerys has Viserion and Rhaegal confined and chained in the Great Pyramid in a makeshift dragon pit beneath the city. Daenerys leads Viserion down to the pit herself and shuts him up inside with several oxen. After gorging himself and falling asleep, he is chained. Daenerys is later escorted by Ser Barristan Selmy to the Great Pyramid’s pit to visit the dragons. She recalls that not long ago he had ridden on her shoulder, with his tail coiled around her shoulder, and she had fed him morsels of charred meat from her hand. When speaking with Daario Naharis later, she thinks to herself that Viserion and Rhaegal are growing more savage every day. When Daenerys takes Prince Quentyn Martell to see her dragons she notices that Viserion has shattered one chain and melted the others. He clings to the roof of the pit like some huge white bat, his claws dug deep into the burnt and crumbling bricks. After Daenerys disappears on Drogon's back, Prince Quentyn attempts to steal a dragon after enlisting the help of the Windblown. Quentyn realizes that Viserion is in the process of making a cave in the brick big enough to sleep in. Viserion appears and is first attracted to Pretty Meris, as he is looking for Daenerys. Quentyn tries to tame him, but a crossbowman of the Brazen Beasts fires a quarrel at Viserion and is then killed by the dragon. Quentyn attempts to dominate Viserion with a whip. Unbeknownst to Quentyn, however, Rhaegal is behind him. The green dragon looses his fire and fatally burns Quentyn. In the aftermath the iron doors are left open and the two dragons escape. Viserion makes his lair in the pyramid of Uhlez. Sometime thereafter, while on the terrace of the Great Pyramid, Ser Barristan espies pale wings moving above a distant line of eastern hills beyond the city walls. As the Second Siege of Meereen begins, Viserion and Rhaegal are both drawn to the battle. Viserion flies above the battle being fought beneath the city. After donning his armor, Tyrion Lannister steps out of his tent and sees some of the Second Sons gawking at the white dragon above. The Wicked Sister is sending corpses through the sky, and some are bursting into flame as Viserion seeks to devour them. Some of the aflame corpses fall to the ground, causing Yunkish horsemen to catch fire, spreading terror and panic. By the time Ben Plumm comes back from his meeting with Malazza, the Girl General, Viserion has flown back to its lair atop the pyramid of Uhlez. "
}